m-okada/QV08/emu/ARM/kinetis_workspace/t03/SDK/platform/drivers/inc/fsl_edma_request.h
    defined(CPU_MK22FN256CAH12) || defined(CPU_MK22FN128CAH12) || defined(CPU_MK22FN256VDC12) || defined(CPU_MK22FN256VLH12) || \
    defined(CPU_MK22FN256VLL12) || defined(CPU_MK22FN256VMP12)
    kDmaRequestMux0Disable = 0|0x100U, /*!< DMAMUX TriggerDisabled. */
    kDmaRequestMux0Reserved1 = 1|0x100U, /*!< Reserved1 */
    kDmaRequestMux0UART0Rx = 2|0x100U, /*!< UART0 Receive. */
    kDmaRequestMux0UART0Tx = 3|0x100U, /*!< UART0 Transmit. */
    kDmaRequestMux0UART1Rx = 4|0x100U, /*!< UART1 Receive. */
    kDmaRequestMux0UART1Tx = 5|0x100U, /*!< UART1 Transmit. */
    kDmaRequestMux0UART2Rx = 6|0x100U, /*!< UART2 Receive. */
    kDmaRequestMux0UART2Tx = 7|0x100U, /*!< UART2 Transmit. */
    kDmaRequestMux0Reserved8 = 8|0x100U, /*!< Reserved8 */
    kDmaRequestMux0Reserved9 = 9|0x100U, /*!< Reserved9 */
    kDmaRequestMux0Reserved10 = 10|0x100U, /*!< Reserved10 */
    kDmaRequestMux0Reserved11 = 11|0x100U, /*!< Reserved11 */
    kDmaRequestMux0I2S0Rx = 12|0x100U, /*!< I2S0 Receive. */
    kDmaRequestMux0I2S0Tx = 13|0x100U, /*!< I2S0 Transmit. */
    kDmaRequestMux0SPI0Rx = 14|0x100U, /*!< SPI0 Receive. */
    kDmaRequestMux0SPI0Tx = 15|0x100U, /*!< SPI0 Transmit. */
    kDmaRequestMux0SPI1 = 16|0x100U, /*!< SPI1 Transmit or Receive. */
    kDmaRequestMux0Reserved17 = 17|0x100U, /*!< Reserved17 */
    kDmaRequestMux0I2C0 = 18|0x100U, /*!< I2C0. */
    kDmaRequestMux0I2C1 = 19|0x100U, /*!< I2C1. */
    kDmaRequestMux0FTM0Channel0 = 20|0x100U, /*!< FTM0 C0V. */
    kDmaRequestMux0FTM0Channel1 = 21|0x100U, /*!< FTM0 C1V. */
    kDmaRequestMux0FTM0Channel2 = 22|0x100U, /*!< FTM0 C2V. */
    kDmaRequestMux0FTM0Channel3 = 23|0x100U, /*!< FTM0 C3V. */
    kDmaRequestMux0FTM0Channel4 = 24|0x100U, /*!< FTM0 C4V. */
    kDmaRequestMux0FTM0Channel5 = 25|0x100U, /*!< FTM0 C5V. */
    kDmaRequestMux0FTM0Channel6 = 26|0x100U, /*!< FTM0 C6V. */
    kDmaRequestMux0FTM0Channel7 = 27|0x100U, /*!< FTM0 C7V. */
    kDmaRequestMux0FTM1Channel0 = 28|0x100U, /*!< FTM1 C0V. */
    kDmaRequestMux0FTM1Channel1 = 29|0x100U, /*!< FTM1 C1V. */
    kDmaRequestMux0FTM2Channel0 = 30|0x100U, /*!< FTM2 C0V. */
    kDmaRequestMux0FTM2Channel1 = 31|0x100U, /*!< FTM2 C1V. */
    kDmaRequestMux0Reserved32 = 32|0x100U, /*!< Reserved32 */
    kDmaRequestMux0Reserved33 = 33|0x100U, /*!< Reserved33 */
    kDmaRequestMux0Reserved34 = 34|0x100U, /*!< Reserved34 */
    kDmaRequestMux0Reserved35 = 35|0x100U, /*!< Reserved35 */
    kDmaRequestMux0Reserved36 = 36|0x100U, /*!< Reserved36 */
    kDmaRequestMux0Reserved37 = 37|0x100U, /*!< Reserved37 */
    kDmaRequestMux0Reserved38 = 38|0x100U, /*!< Reserved38 */
    kDmaRequestMux0Reserved39 = 39|0x100U, /*!< Reserved39 */
    kDmaRequestMux0ADC0 = 40|0x100U, /*!< ADC0. */
    kDmaRequestMux0ADC1 = 41|0x100U, /*!< ADC1. */
    kDmaRequestMux0CMP0 = 42|0x100U, /*!< CMP0. */
    kDmaRequestMux0CMP1 = 43|0x100U, /*!< CMP1. */
    kDmaRequestMux0Reserved44 = 44|0x100U, /*!< Reserved44 */
    kDmaRequestMux0DAC0 = 45|0x100U, /*!< DAC0. */
    kDmaRequestMux0Reserved46 = 46|0x100U, /*!< Reserved46 */
    kDmaRequestMux0Reserved47 = 47|0x100U, /*!< Reserved47 */
    kDmaRequestMux0PDB = 48|0x100U, /*!< PDB0. */
    kDmaRequestMux0PortA = 49|0x100U, /*!< PTA. */
    kDmaRequestMux0PortB = 50|0x100U, /*!< PTB. */
    kDmaRequestMux0PortC = 51|0x100U, /*!< PTC. */
    kDmaRequestMux0PortD = 52|0x100U, /*!< PTD. */
    kDmaRequestMux0PortE = 53|0x100U, /*!< PTE. */
    kDmaRequestMux0Reserved54 = 54|0x100U, /*!< Reserved54 */
    kDmaRequestMux0Reserved55 = 55|0x100U, /*!< Reserved55 */
    kDmaRequestMux0Reserved56 = 56|0x100U, /*!< Reserved56 */
    kDmaRequestMux0Reserved57 = 57|0x100U, /*!< Reserved57 */
    kDmaRequestMux0LPUART0Rx = 58|0x100U, /*!< LPUART0 Receive. */
    kDmaRequestMux0LPUART0Tx = 59|0x100U, /*!< LPUART0 Transmit. */
    kDmaRequestMux0AlwaysOn60 = 60|0x100U, /*!< DMAMUX Always Enabled_slot. */
    kDmaRequestMux0AlwaysOn61 = 61|0x100U, /*!< DMAMUX Always Enabled_slot. */
    kDmaRequestMux0AlwaysOn62 = 62|0x100U, /*!< DMAMUX Always Enabled_slot. */
    kDmaRequestMux0AlwaysOn63 = 63|0x100U, /*!< DMAMUX Always Enabled_slot. */
#elif defined(CPU_MK22FN512CAP12) || defined(CPU_MK22FN512VDC12) || defined(CPU_MK22FN512VLH12) || defined(CPU_MK22FN512VLL12) || \
    defined(CPU_MK22FN512VMP12)
    kDmaRequestMux0Disable = 0|0x100U, /*!< DMAMUX TriggerDisabled. */
    kDmaRequestMux0Reserved1 = 1|0x100U, /*!< Reserved1 */
    kDmaRequestMux0UART0Rx = 2|0x100U, /*!< UART0 Receive. */
    kDmaRequestMux0UART0Tx = 3|0x100U, /*!< UART0 Transmit. */
    kDmaRequestMux0UART1Rx = 4|0x100U, /*!< UART1 Receive. */
    kDmaRequestMux0UART1Tx = 5|0x100U, /*!< UART1 Transmit. */
    kDmaRequestMux0UART2Rx = 6|0x100U, /*!< UART2 Receive. */
    kDmaRequestMux0UART2Tx = 7|0x100U, /*!< UART2 Transmit. */
    kDmaRequestMux0Reserved8 = 8|0x100U, /*!< Reserved8 */
    kDmaRequestMux0Reserved9 = 9|0x100U, /*!< Reserved9 */
    kDmaRequestMux0Reserved10 = 10|0x100U, /*!< Reserved10 */
    kDmaRequestMux0Reserved11 = 11|0x100U, /*!< Reserved11 */
    kDmaRequestMux0I2S0Rx = 12|0x100U, /*!< I2S0 Receive. */
    kDmaRequestMux0I2S0Tx = 13|0x100U, /*!< I2S0 Transmit. */
    kDmaRequestMux0SPI0Rx = 14|0x100U, /*!< SPI0 Receive. */
    kDmaRequestMux0SPI0Tx = 15|0x100U, /*!< SPI0 Transmit. */
    kDmaRequestMux0SPI1 = 16|0x100U, /*!< SPI1 Transmit or Receive. */
    kDmaRequestMux0Reserved17 = 17|0x100U, /*!< Reserved17 */
    kDmaRequestMux0I2C0 = 18|0x100U, /*!< I2C0. */
    kDmaRequestMux0I2C1 = 19|0x100U, /*!< I2C1. */
    kDmaRequestMux0FTM0Channel0 = 20|0x100U, /*!< FTM0 C0V. */
    kDmaRequestMux0FTM0Channel1 = 21|0x100U, /*!< FTM0 C1V. */
    kDmaRequestMux0FTM0Channel2 = 22|0x100U, /*!< FTM0 C2V. */
    kDmaRequestMux0FTM0Channel3 = 23|0x100U, /*!< FTM0 C3V. */
    kDmaRequestMux0FTM0Channel4 = 24|0x100U, /*!< FTM0 C4V. */
    kDmaRequestMux0FTM0Channel5 = 25|0x100U, /*!< FTM0 C5V. */
    kDmaRequestMux0FTM0Channel6 = 26|0x100U, /*!< FTM0 C6V. */
    kDmaRequestMux0FTM0Channel7 = 27|0x100U, /*!< FTM0 C7V. */
    kDmaRequestMux0FTM1Channel0 = 28|0x100U, /*!< FTM1 C0V. */
    kDmaRequestMux0FTM1Channel1 = 29|0x100U, /*!< FTM1 C1V. */
    kDmaRequestMux0FTM2Channel0 = 30|0x100U, /*!< FTM2 C0V. */
    kDmaRequestMux0FTM2Channel1 = 31|0x100U, /*!< FTM2 C1V. */
    kDmaRequestMux0FTM3Channel0 = 32|0x100U, /*!< FTM3 C0V. */
    kDmaRequestMux0FTM3Channel1 = 33|0x100U, /*!< FTM3 C1V. */
    kDmaRequestMux0FTM3Channel2 = 34|0x100U, /*!< FTM3 C2V. */
    kDmaRequestMux0FTM3Channel3 = 35|0x100U, /*!< FTM3 C3V. */
    kDmaRequestMux0FTM3Channel4 = 36|0x100U, /*!< FTM3 C4V. */
    kDmaRequestMux0FTM3Channel5 = 37|0x100U, /*!< FTM3 C5V. */
    kDmaRequestMux0FTM3Channel6 = 38|0x100U, /*!< FTM3 C6V. */
    kDmaRequestMux0FTM3Channel7 = 39|0x100U, /*!< FTM3 C7V. */
    kDmaRequestMux0ADC0 = 40|0x100U, /*!< ADC0. */
    kDmaRequestMux0ADC1 = 41|0x100U, /*!< ADC1. */
    kDmaRequestMux0CMP0 = 42|0x100U, /*!< CMP0. */
    kDmaRequestMux0CMP1 = 43|0x100U, /*!< CMP1. */
    kDmaRequestMux0Reserved44 = 44|0x100U, /*!< Reserved44 */
    kDmaRequestMux0DAC0 = 45|0x100U, /*!< DAC0. */
    kDmaRequestMux0DAC1 = 46|0x100U, /*!< DAC1. */
    kDmaRequestMux0Reserved47 = 47|0x100U, /*!< Reserved47 */
    kDmaRequestMux0PDB = 48|0x100U, /*!< PDB0. */
    kDmaRequestMux0PortA = 49|0x100U, /*!< PTA. */
    kDmaRequestMux0PortB = 50|0x100U, /*!< PTB. */
    kDmaRequestMux0PortC = 51|0x100U, /*!< PTC. */
    kDmaRequestMux0PortD = 52|0x100U, /*!< PTD. */
    kDmaRequestMux0PortE = 53|0x100U, /*!< PTE. */
    kDmaRequestMux0Reserved54 = 54|0x100U, /*!< Reserved54 */
    kDmaRequestMux0Reserved55 = 55|0x100U, /*!< Reserved55 */
    kDmaRequestMux0Reserved56 = 56|0x100U, /*!< Reserved56 */
    kDmaRequestMux0Reserved57 = 57|0x100U, /*!< Reserved57 */
    kDmaRequestMux0LPUART0Rx = 58|0x100U, /*!< LPUART0 Receive. */
    kDmaRequestMux0LPUART0Tx = 59|0x100U, /*!< LPUART0 Transmit. */
    kDmaRequestMux0AlwaysOn60 = 60|0x100U, /*!< DMAMUX Always Enabled_slot. */
    kDmaRequestMux0AlwaysOn61 = 61|0x100U, /*!< DMAMUX Always Enabled_slot. */
    kDmaRequestMux0AlwaysOn62 = 62|0x100U, /*!< DMAMUX Always Enabled_slot. */
    kDmaRequestMux0AlwaysOn63 = 63|0x100U, /*!< DMAMUX Always Enabled_slot. */
#elif defined(CPU_MK24FN1M0VDC12) || defined(CPU_MK24FN1M0VLL12) || defined(CPU_MK24FN1M0VLQ12)
    kDmaRequestMux0Disable = 0|0x100U, /*!< DMAMUX TriggerDisabled. */
    kDmaRequestMux0Reserved1 = 1|0x100U, /*!< Reserved1 */
    kDmaRequestMux0UART0Rx = 2|0x100U, /*!< UART0 Receive. */
    kDmaRequestMux0UART0Tx = 3|0x100U, /*!< UART0 Transmit. */
    kDmaRequestMux0UART1Rx = 4|0x100U, /*!< UART1 Receive. */
    kDmaRequestMux0UART1Tx = 5|0x100U, /*!< UART1 Transmit. */
    kDmaRequestMux0UART2Rx = 6|0x100U, /*!< UART2 Receive. */
    kDmaRequestMux0UART2Tx = 7|0x100U, /*!< UART2 Transmit. */
    kDmaRequestMux0UART3Rx = 8|0x100U, /*!< UART3 Receive. */
    kDmaRequestMux0UART3Tx = 9|0x100U, /*!< UART3 Transmit. */
    kDmaRequestMux0UART4 = 10|0x100U, /*!< UART4 Transmit or Receive. */
    kDmaRequestMux0UART5 = 11|0x100U, /*!< UART5 Transmit or Receive. */
    kDmaRequestMux0I2S0Rx = 12|0x100U, /*!< I2S0 Receive. */
    kDmaRequestMux0I2S0Tx = 13|0x100U, /*!< I2S0 Transmit. */
    kDmaRequestMux0SPI0Rx = 14|0x100U, /*!< SPI0 Receive. */
    kDmaRequestMux0SPI0Tx = 15|0x100U, /*!< SPI0 Transmit. */
    kDmaRequestMux0SPI1 = 16|0x100U, /*!< SPI1 Transmit or Receive. */
    kDmaRequestMux0SPI2 = 17|0x100U, /*!< SPI2 Transmit or Receive. */
    kDmaRequestMux0I2C0 = 18|0x100U, /*!< I2C0. */
    kDmaRequestMux0I2C1I2C2 = 19|0x100U, /*!< I2C1 and I2C2. */
    kDmaRequestMux0FTM0Channel0 = 20|0x100U, /*!< FTM0 C0V. */
    kDmaRequestMux0FTM0Channel1 = 21|0x100U, /*!< FTM0 C1V. */
    kDmaRequestMux0FTM0Channel2 = 22|0x100U, /*!< FTM0 C2V. */
    kDmaRequestMux0FTM0Channel3 = 23|0x100U, /*!< FTM0 C3V. */
    kDmaRequestMux0FTM0Channel4 = 24|0x100U, /*!< FTM0 C4V. */
    kDmaRequestMux0FTM0Channel5 = 25|0x100U, /*!< FTM0 C5V. */
    kDmaRequestMux0FTM0Channel6 = 26|0x100U, /*!< FTM0 C6V. */
    kDmaRequestMux0FTM0Channel7 = 27|0x100U, /*!< FTM0 C7V. */
    kDmaRequestMux0FTM1Channel0 = 28|0x100U, /*!< FTM1 C0V. */
    kDmaRequestMux0FTM1Channel1 = 29|0x100U, /*!< FTM1 C1V. */
    kDmaRequestMux0FTM2Channel0 = 30|0x100U, /*!< FTM2 C0V. */
    kDmaRequestMux0FTM2Channel1 = 31|0x100U, /*!< FTM2 C1V. */
    kDmaRequestMux0FTM3Channel0 = 32|0x100U, /*!< FTM3 C0V. */
    kDmaRequestMux0FTM3Channel1 = 33|0x100U, /*!< FTM3 C1V. */
    kDmaRequestMux0FTM3Channel2 = 34|0x100U, /*!< FTM3 C2V. */
    kDmaRequestMux0FTM3Channel3 = 35|0x100U, /*!< FTM3 C3V. */
    kDmaRequestMux0FTM3Channel4 = 36|0x100U, /*!< FTM3 C4V. */
    kDmaRequestMux0FTM3Channel5 = 37|0x100U, /*!< FTM3 C5V. */
    kDmaRequestMux0FTM3Channel6 = 38|0x100U, /*!< FTM3 C6V. */
    kDmaRequestMux0FTM3Channel7 = 39|0x100U, /*!< FTM3 C7V. */
    kDmaRequestMux0ADC0 = 40|0x100U, /*!< ADC0. */
    kDmaRequestMux0ADC1 = 41|0x100U, /*!< ADC1. */
    kDmaRequestMux0CMP0 = 42|0x100U, /*!< CMP0. */
    kDmaRequestMux0CMP1 = 43|0x100U, /*!< CMP1. */
    kDmaRequestMux0CMP2 = 44|0x100U, /*!< CMP2. */
    kDmaRequestMux0DAC0 = 45|0x100U, /*!< DAC0. */
    kDmaRequestMux0DAC1 = 46|0x100U, /*!< DAC1. */
    kDmaRequestMux0CMT = 47|0x100U, /*!< CMT. */
    kDmaRequestMux0PDB = 48|0x100U, /*!< PDB0. */
    kDmaRequestMux0PortA = 49|0x100U, /*!< PTA. */
    kDmaRequestMux0PortB = 50|0x100U, /*!< PTB. */
    kDmaRequestMux0PortC = 51|0x100U, /*!< PTC. */
    kDmaRequestMux0PortD = 52|0x100U, /*!< PTD. */
    kDmaRequestMux0PortE = 53|0x100U, /*!< PTE. */
    kDmaRequestMux0Reserved54 = 54|0x100U, /*!< Reserved54 */
    kDmaRequestMux0Reserved55 = 55|0x100U, /*!< Reserved55 */
    kDmaRequestMux0Reserved56 = 56|0x100U, /*!< Reserved56 */
    kDmaRequestMux0Reserved57 = 57|0x100U, /*!< Reserved57 */
    kDmaRequestMux0AlwaysOn58 = 58|0x100U, /*!< DMAMUX Always Enabled_slot. */
    kDmaRequestMux0AlwaysOn59 = 59|0x100U, /*!< DMAMUX Always Enabled_slot. */
    kDmaRequestMux0AlwaysOn60 = 60|0x100U, /*!< DMAMUX Always Enabled_slot. */
    kDmaRequestMux0AlwaysOn61 = 61|0x100U, /*!< DMAMUX Always Enabled_slot. */
    kDmaRequestMux0AlwaysOn62 = 62|0x100U, /*!< DMAMUX Always Enabled_slot. */
    kDmaRequestMux0AlwaysOn63 = 63|0x100U, /*!< DMAMUX Always Enabled_slot. */
#elif defined(CPU_MK24FN256VDC12)
    kDmaRequestMux0Disable = 0|0x100U, /*!< DMAMUX TriggerDisabled. */
    kDmaRequestMux0Reserved1 = 1|0x100U, /*!< Reserved1 */
    kDmaRequestMux0UART0Rx = 2|0x100U, /*!< UART0 Receive. */
    kDmaRequestMux0UART0Tx = 3|0x100U, /*!< UART0 Transmit. */
    kDmaRequestMux0UART1Rx = 4|0x100U, /*!< UART1 Receive. */
    kDmaRequestMux0UART1Tx = 5|0x100U, /*!< UART1 Transmit. */
    kDmaRequestMux0UART2Rx = 6|0x100U, /*!< UART2 Receive. */
    kDmaRequestMux0UART2Tx = 7|0x100U, /*!< UART2 Transmit. */
    kDmaRequestMux0UART3Rx = 8|0x100U, /*!< UART3 Receive. */
    kDmaRequestMux0UART3Tx = 9|0x100U, /*!< UART3 Transmit. */
    kDmaRequestMux0UART4 = 10|0x100U, /*!< UART4 Transmit or Receive. */
    kDmaRequestMux0UART5 = 11|0x100U, /*!< UART5 Transmit or Receive. */
    kDmaRequestMux0I2S0Rx = 12|0x100U, /*!< I2S0 Receive. */
    kDmaRequestMux0I2S0Tx = 13|0x100U, /*!< I2S0 Transmit. */
    kDmaRequestMux0SPI0Rx = 14|0x100U, /*!< SPI0 Receive. */
    kDmaRequestMux0SPI0Tx = 15|0x100U, /*!< SPI0 Transmit. */
    kDmaRequestMux0SPI1 = 16|0x100U, /*!< SPI1 Transmit or Receive. */
    kDmaRequestMux0SPI2 = 17|0x100U, /*!< SPI2 Transmit or Receive. */
    kDmaRequestMux0I2C0 = 18|0x100U, /*!< I2C0. */
    kDmaRequestMux0I2C1I2C2 = 19|0x100U, /*!< I2C1 and I2C2. */
    kDmaRequestMux0FTM0Channel0 = 20|0x100U, /*!< FTM0 C0V. */
    kDmaRequestMux0FTM0Channel1 = 21|0x100U, /*!< FTM0 C1V. */
    kDmaRequestMux0FTM0Channel2 = 22|0x100U, /*!< FTM0 C2V. */
    kDmaRequestMux0FTM0Channel3 = 23|0x100U, /*!< FTM0 C3V. */
    kDmaRequestMux0FTM0Channel4 = 24|0x100U, /*!< FTM0 C4V. */
    kDmaRequestMux0FTM0Channel5 = 25|0x100U, /*!< FTM0 C5V. */
    kDmaRequestMux0FTM0Channel6 = 26|0x100U, /*!< FTM0 C6V. */
    kDmaRequestMux0FTM0Channel7 = 27|0x100U, /*!< FTM0 C7V. */
    kDmaRequestMux0FTM1Channel0 = 28|0x100U, /*!< FTM1 C0V. */
    kDmaRequestMux0FTM1Channel1 = 29|0x100U, /*!< FTM1 C1V. */
    kDmaRequestMux0FTM2Channel0 = 30|0x100U, /*!< FTM2 C0V. */
    kDmaRequestMux0FTM2Channel1 = 31|0x100U, /*!< FTM2 C1V. */
    kDmaRequestMux0FTM3Channel0 = 32|0x100U, /*!< FTM3 C0V. */
    kDmaRequestMux0FTM3Channel1 = 33|0x100U, /*!< FTM3 C1V. */
    kDmaRequestMux0FTM3Channel2 = 34|0x100U, /*!< FTM3 C2V. */
    kDmaRequestMux0FTM3Channel3 = 35|0x100U, /*!< FTM3 C3V. */
    kDmaRequestMux0FTM3Channel4 = 36|0x100U, /*!< FTM3 C4V. */
    kDmaRequestMux0FTM3Channel5 = 37|0x100U, /*!< FTM3 C5V. */
    kDmaRequestMux0FTM3Channel6 = 38|0x100U, /*!< FTM3 C6V. */
    kDmaRequestMux0FTM3Channel7 = 39|0x100U, /*!< FTM3 C7V. */
    kDmaRequestMux0ADC0 = 40|0x100U, /*!< ADC0. */
    kDmaRequestMux0ADC1 = 41|0x100U, /*!< ADC1. */
    kDmaRequestMux0CMP0 = 42|0x100U, /*!< CMP0. */
    kDmaRequestMux0CMP1 = 43|0x100U, /*!< CMP1. */
    kDmaRequestMux0Reserved44 = 44|0x100U, /*!< Reserved44 */
    kDmaRequestMux0DAC0 = 45|0x100U, /*!< DAC0. */
    kDmaRequestMux0Reserved46 = 46|0x100U, /*!< Reserved46 */
    kDmaRequestMux0CMT = 47|0x100U, /*!< CMT. */
    kDmaRequestMux0PDB = 48|0x100U, /*!< PDB0. */
    kDmaRequestMux0PortA = 49|0x100U, /*!< PTA. */
    kDmaRequestMux0PortB = 50|0x100U, /*!< PTB. */
    kDmaRequestMux0PortC = 51|0x100U, /*!< PTC. */
    kDmaRequestMux0PortD = 52|0x100U, /*!< PTD. */
    kDmaRequestMux0PortE = 53|0x100U, /*!< PTE. */
    kDmaRequestMux0Reserved54 = 54|0x100U, /*!< Reserved54 */
    kDmaRequestMux0Reserved55 = 55|0x100U, /*!< Reserved55 */
    kDmaRequestMux0Reserved56 = 56|0x100U, /*!< Reserved56 */
    kDmaRequestMux0Reserved57 = 57|0x100U, /*!< Reserved57 */
    kDmaRequestMux0AlwaysOn58 = 58|0x100U, /*!< DMAMUX Always Enabled_slot. */
    kDmaRequestMux0AlwaysOn59 = 59|0x100U, /*!< DMAMUX Always Enabled_slot. */
    kDmaRequestMux0AlwaysOn60 = 60|0x100U, /*!< DMAMUX Always Enabled_slot. */
    kDmaRequestMux0AlwaysOn61 = 61|0x100U, /*!< DMAMUX Always Enabled_slot. */
    kDmaRequestMux0AlwaysOn62 = 62|0x100U, /*!< DMAMUX Always Enabled_slot. */
    kDmaRequestMux0AlwaysOn63 = 63|0x100U, /*!< DMAMUX Always Enabled_slot. */
#elif defined(CPU_MK26FN2M0CAC18) || defined(CPU_MK26FN2M0VLQ18) || defined(CPU_MK26FN2M0VMD18) || defined(CPU_MK26FN2M0VMI18)
    kDmaRequestMux0Disable = 0|0x100U, /*!< DMAMUX TriggerDisabled.  */
    kDmaRequestMux0TSI0 = 1|0x100U, /*!< TSI0.  */
    kDmaRequestMux0UART0Rx = 2|0x100U, /*!< UART0 Receive.  */
    kDmaRequestMux0UART0Tx = 3|0x100U, /*!< UART0 Transmit.  */
    kDmaRequestMux0UART1Rx = 4|0x100U, /*!< UART1 Receive.  */
    kDmaRequestMux0UART1Tx = 5|0x100U, /*!< UART1 Transmit.  */
    kDmaRequestMux0UART2Rx = 6|0x100U, /*!< UART2 Receive.  */
    kDmaRequestMux0UART2Tx = 7|0x100U, /*!< UART2 Transmit.  */
    kDmaRequestMux0UART3Rx = 8|0x100U, /*!< UART3 Receive.  */
    kDmaRequestMux0UART3Tx = 9|0x100U, /*!< UART3 Transmit.  */
    kDmaRequestMux0UART4 = 10|0x100U, /*!< UART4 Transmit or Receive.  */
    kDmaRequestMux0Reserved11 = 11|0x100U, /*!< Reserved11 */
    kDmaRequestMux0I2S0Rx = 12|0x100U, /*!< I2S0 Receive.  */
    kDmaRequestMux0I2S0Tx = 13|0x100U, /*!< I2S0 Transmit.  */
    kDmaRequestMux0SPI0Rx = 14|0x100U, /*!< SPI0 Receive.  */
    kDmaRequestMux0SPI0Tx = 15|0x100U, /*!< SPI0 Transmit.  */
    kDmaRequestMux0SPI1Rx = 16|0x100U, /*!< SPI1 Receive.  */
    kDmaRequestMux0SPI1Tx = 17|0x100U, /*!< SPI1 Transmit.  */
    kDmaRequestMux0I2C0I2C3 = 18|0x100U, /*!< I2C0 and I2C3.  */
    kDmaRequestMux0I2C0 = 18|0x100U, /*!< I2C0 and I2C3.  */
    kDmaRequestMux0I2C3 = 18|0x100U, /*!< I2C0 and I2C3.  */
    kDmaRequestMux0I2C1I2C2 = 19|0x100U, /*!< I2C1 and I2C2.  */
    kDmaRequestMux0I2C1 = 19|0x100U, /*!< I2C1 and I2C2.  */
    kDmaRequestMux0I2C2 = 19|0x100U, /*!< I2C1 and I2C2.  */
    kDmaRequestMux0FTM0Channel0 = 20|0x100U, /*!< FTM0 C0V.  */
    kDmaRequestMux0FTM0Channel1 = 21|0x100U, /*!< FTM0 C1V.  */
    kDmaRequestMux0FTM0Channel2 = 22|0x100U, /*!< FTM0 C2V.  */
    kDmaRequestMux0FTM0Channel3 = 23|0x100U, /*!< FTM0 C3V.  */
    kDmaRequestMux0FTM0Channel4 = 24|0x100U, /*!< FTM0 C4V.  */
    kDmaRequestMux0FTM0Channel5 = 25|0x100U, /*!< FTM0 C5V.  */
    kDmaRequestMux0FTM0Channel6 = 26|0x100U, /*!< FTM0 C6V.  */
    kDmaRequestMux0FTM0Channel7 = 27|0x100U, /*!< FTM0 C7V.  */
    kDmaRequestMux0FTM1TPM1Channel0 = 28|0x100U, /*!< FTM1 C0V and TPM1_C0V.  */
    kDmaRequestMux0FTM1Channel0 = 28|0x100U, /*!< FTM1 C0V and TPM1 C0V.  */
    kDmaRequestMux0TPM1Channel0 = 28|0x100U, /*!< FTM1 C0V and TPM1 C0V.  */
    kDmaRequestMux0FTM1TPM1Channel1 = 29|0x100U, /*!< FTM1 C1V and TPM1_C1V.  */
    kDmaRequestMux0FTM1Channel1 = 29|0x100U, /*!< FTM1 C1V and TPM1 C1V.  */
    kDmaRequestMux0TPM1Channel1 = 29|0x100U, /*!< FTM1 C1V and TPM1 C1V.  */
    kDmaRequestMux0FTM2TPM2Channel0 = 30|0x100U, /*!< FTM2 C0V and TPM2_C0V.  */
    kDmaRequestMux0FTM2Channel0 = 30|0x100U, /*!< FTM2 C0V and TPM2 C0V.  */
    kDmaRequestMux0TPM2Channel0 = 30|0x100U, /*!< FTM2 C0V and TPM2 C0V.  */
    kDmaRequestMux0FTM2TPM2Channel1 = 31|0x100U, /*!< FTM2 C1V and TPM2_C1V.  */
    kDmaRequestMux0FTM2Channel1 = 31|0x100U, /*!< FTM2 C1V and TPM2 C1V.  */
    kDmaRequestMux0TPM2Channel1 = 31|0x100U, /*!< FTM2 C1V and TPM2 C1V.  */
    kDmaRequestMux0FTM3Channel0 = 32|0x100U, /*!< FTM3 C0V.  */
    kDmaRequestMux0FTM3Channel1 = 33|0x100U, /*!< FTM3 C1V.  */
    kDmaRequestMux0FTM3Channel2 = 34|0x100U, /*!< FTM3 C2V.  */
    kDmaRequestMux0FTM3Channel3 = 35|0x100U, /*!< FTM3 C3V.  */
    kDmaRequestMux0FTM3Channel4 = 36|0x100U, /*!< FTM3 C4V.  */
    kDmaRequestMux0FTM3Channel5 = 37|0x100U, /*!< FTM3 C5V.  */
    kDmaRequestMux0FTM3Channel6SPI2Rx = 38|0x100U, /*!< FTM3 C6V and SPI2 Receive.  */
    kDmaRequestMux0FTM3Channel6 = 38|0x100U, /*!< FTM3 C6V and SPI2 Receive.  */
    kDmaRequestMux0SPI2Rx = 38|0x100U, /*!< FTM3 C6V and SPI2 Receive.  */
    kDmaRequestMux0FTM3Channel7SPI2Tx = 39|0x100U, /*!< FTM3 C7V and SPI2 Transmit.  */
    kDmaRequestMux0FTM3Channel7 = 39|0x100U, /*!< FTM3 C7V and SPI2 Transmit.  */
    kDmaRequestMux0SPI2Tx = 39|0x100U, /*!< FTM3 C7V and SPI2 Transmit.  */
    kDmaRequestMux0ADC0 = 40|0x100U, /*!< ADC0.  */
    kDmaRequestMux0ADC1 = 41|0x100U, /*!< ADC1.  */
    kDmaRequestMux0CMP0 = 42|0x100U, /*!< CMP0.  */
    kDmaRequestMux0CMP1 = 43|0x100U, /*!< CMP1.  */
    kDmaRequestMux0CMP2CMP3 = 44|0x100U, /*!< CMP2 and CMP3.  */
    kDmaRequestMux0CMP2 = 44|0x100U, /*!< CMP2 and CMP3.  */
    kDmaRequestMux0CMP3 = 44|0x100U, /*!< CMP2 and CMP3.  */
    kDmaRequestMux0DAC0 = 45|0x100U, /*!< DAC0.  */
    kDmaRequestMux0DAC1 = 46|0x100U, /*!< DAC1.  */
    kDmaRequestMux0CMT = 47|0x100U, /*!< CMT.  */
    kDmaRequestMux0PDB = 48|0x100U, /*!< PDB0.  */
    kDmaRequestMux0PortA = 49|0x100U, /*!< PTA.  */
    kDmaRequestMux0PortB = 50|0x100U, /*!< PTB.  */
    kDmaRequestMux0PortC = 51|0x100U, /*!< PTC.  */
    kDmaRequestMux0PortD = 52|0x100U, /*!< PTD.  */
    kDmaRequestMux0PortE = 53|0x100U, /*!< PTE.  */
    kDmaRequestMux0Reserved54 = 54|0x100U, /*!< Reserved54 */
    kDmaRequestMux0TPM1Overflow = 55|0x100U, /*!< TPM1.  */
    kDmaRequestMux0IEEE1588Timer2TPM2_Overflow = 56|0x100U, /*!<TPM2 DMA request. */
    kDmaRequestMux0TPM2Overflow = 56|0x100U, /*!< ENET IEEE 1588 timer 2 and TPM2.  */
    kDmaRequestMux0Reserved57 = 57|0x100U, /*!< Reserved57 */
    kDmaRequestMux0LPUART0Rx = 58|0x100U, /*!< LPUART0 Receive.  */
    kDmaRequestMux0LPUART0Tx = 59|0x100U, /*!< LPUART0 Transmit.  */
    kDmaRequestMux0AlwaysOn60 = 60|0x100U, /*!< DMAMUX Always Enabled_slot.  */
    kDmaRequestMux0AlwaysOn61 = 61|0x100U, /*!< DMAMUX Always Enabled_slot.  */
    kDmaRequestMux0AlwaysOn62 = 62|0x100U, /*!< DMAMUX Always Enabled_slot.  */
    kDmaRequestMux0AlwaysOn63 = 63|0x100U, /*!< DMAMUX Always Enabled_slot.  */
#elif defined(CPU_MK50DX256CLL10) || defined(CPU_MK50DN512CLL10)
    kDmaRequestMux0Disable = 0|0x100U, /*!< Disable */
    kDmaRequestMux0Reserved1 = 1|0x100U, /*!< Reserved1 */
    kDmaRequestMux0UART0Rx = 2|0x100U, /*!< UART0 receive complete */
    kDmaRequestMux0UART0Tx = 3|0x100U, /*!< UART0 transmit complete */
    kDmaRequestMux0UART1Rx = 4|0x100U, /*!< UART1 receive complete */
    kDmaRequestMux0UART1Tx = 5|0x100U, /*!< UART1 transmit complete */
    kDmaRequestMux0UART2Rx = 6|0x100U, /*!< UART2 receive complete */
    kDmaRequestMux0UART2Tx = 7|0x100U, /*!< UART2 transmit complete */
    kDmaRequestMux0UART3Rx = 8|0x100U, /*!< UART3 receive complete */
    kDmaRequestMux0UART3Tx = 9|0x100U, /*!< UART3 transmit complete */
    kDmaRequestMux0UART4Rx = 10|0x100U, /*!< UART4 receive complete */
    kDmaRequestMux0UART4Tx = 11|0x100U, /*!< UART4 transmit complete */
    kDmaRequestMux0Reserved12 = 12|0x100U, /*!< Reserved12 */
    kDmaRequestMux0Reserved13 = 13|0x100U, /*!< Reserved13 */
    kDmaRequestMux0I2S0Rx = 14|0x100U, /*!< I2S0 receive complete */
    kDmaRequestMux0I2S0Tx = 15|0x100U, /*!< I2S0 transmit complete */
    kDmaRequestMux0SPI0Rx = 16|0x100U, /*!< SPI0 receive complete */
    kDmaRequestMux0SPI0Tx = 17|0x100U, /*!< SPI0 transmit complete */
    kDmaRequestMux0SPI1Rx = 18|0x100U, /*!< SPI1 receive complete */
    kDmaRequestMux0SPI1Tx = 19|0x100U, /*!< SPI1 transmit complete */
    kDmaRequestMux0SPI2Rx = 20|0x100U, /*!< SPI2 receive complete */
    kDmaRequestMux0SPI2Tx = 21|0x100U, /*!< SPI2 transmit complete */
    kDmaRequestMux0I2C0 = 22|0x100U, /*!< I2C0 transmission complete */
