m-okada/QV08/emu/ARM/kinetis_workspace/t03/SDK/platform/drivers/inc/fsl_edma_request.h
    kDmaRequestMux0I2C1 = 23|0x100U, /*!< I2C1 transmission complete */
    kDmaRequestMux0FTM0Channel0 = 24|0x100U, /*!< FTM0 channel 0 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel1 = 25|0x100U, /*!< FTM0 channel 1 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel2 = 26|0x100U, /*!< FTM0 channel 2 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel3 = 27|0x100U, /*!< FTM0 channel 3 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel4 = 28|0x100U, /*!< FTM0 channel 4 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel5 = 29|0x100U, /*!< FTM0 channel 5 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel6 = 30|0x100U, /*!< FTM0 channel 6 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel7 = 31|0x100U, /*!< FTM0 channel 7 event (CMP or CAP) */
    kDmaRequestMux0FTM1Channel0 = 32|0x100U, /*!< FTM1 channel 0 event (CMP or CAP) */
    kDmaRequestMux0FTM1Channel1 = 33|0x100U, /*!< FTM1 channel 1 event (CMP or CAP) */
    kDmaRequestMux0FTM2Channel0 = 34|0x100U, /*!< FTM2 channel 0 event (CMP or CAP) */
    kDmaRequestMux0FTM2Channel1 = 35|0x100U, /*!< FTM2 channel 1 event (CMP or CAP) */
    kDmaRequestMux0Reserved36 = 36|0x100U, /*!< Reserved36 */
    kDmaRequestMux0Reserved37 = 37|0x100U, /*!< Reserved37 */
    kDmaRequestMux0Reserved38 = 38|0x100U, /*!< Reserved38 */
    kDmaRequestMux0Reserved39 = 39|0x100U, /*!< Reserved39 */
    kDmaRequestMux0ADC0 = 40|0x100U, /*!< ADC0 conversion complete */
    kDmaRequestMux0ADC1 = 41|0x100U, /*!< ADC1 conversion complete */
    kDmaRequestMux0CMP0 = 42|0x100U, /*!< CMP0 Output */
    kDmaRequestMux0CMP1 = 43|0x100U, /*!< CMP1 Output */
    kDmaRequestMux0CMP2 = 44|0x100U, /*!< CMP2 Output */
    kDmaRequestMux0DAC0 = 45|0x100U, /*!< DAC0 buffer pointer reaches upper or lower limit */
    kDmaRequestMux0DAC1 = 46|0x100U, /*!< DAC1 buffer pointer reaches upper or lower limit */
    kDmaRequestMux0CMT = 47|0x100U, /*!< CMT end of modulation cycle event */
    kDmaRequestMux0PDB0 = 48|0x100U, /*!< PDB0 programmable interrupt delay event */
    kDmaRequestMux0PortA = 49|0x100U, /*!< PORTA rising, falling or both edges */
    kDmaRequestMux0PortB = 50|0x100U, /*!< PORTB rising, falling or both edges */
    kDmaRequestMux0PortC = 51|0x100U, /*!< PORTC rising, falling or both edges */
    kDmaRequestMux0PortD = 52|0x100U, /*!< PORTD rising, falling or both edges */
    kDmaRequestMux0PortE = 53|0x100U, /*!< PORTE rising, falling or both edges */
    kDmaRequestMux0AlwaysOn54 = 54|0x100U, /*!< Always enabled 54 */
    kDmaRequestMux0AlwaysOn55 = 55|0x100U, /*!< Always enabled 55 */
    kDmaRequestMux0AlwaysOn56 = 56|0x100U, /*!< Always enabled 56 */
    kDmaRequestMux0AlwaysOn57 = 57|0x100U, /*!< Always enabled 57 */
    kDmaRequestMux0AlwaysOn58 = 58|0x100U, /*!< Always enabled 58 */
    kDmaRequestMux0AlwaysOn59 = 59|0x100U, /*!< Always enabled 59 */
    kDmaRequestMux0AlwaysOn60 = 60|0x100U, /*!< Always enabled 60 */
    kDmaRequestMux0AlwaysOn61 = 61|0x100U, /*!< Always enabled 61 */
    kDmaRequestMux0AlwaysOn62 = 62|0x100U, /*!< Always enabled 62 */
    kDmaRequestMux0AlwaysOn63 = 63|0x100U, /*!< Always enabled 63 */
#elif defined(CPU_MK50DX256CLK10) || defined(CPU_MK51DX256CLK10)
    kDmaRequestMux0Disable = 0|0x100U, /*!< Disable */
    kDmaRequestMux0Reserved1 = 1|0x100U, /*!< Reserved1 */
    kDmaRequestMux0UART0Rx = 2|0x100U, /*!< UART0 receive complete */
    kDmaRequestMux0UART0Tx = 3|0x100U, /*!< UART0 transmit complete */
    kDmaRequestMux0UART1Rx = 4|0x100U, /*!< UART1 receive complete */
    kDmaRequestMux0UART1Tx = 5|0x100U, /*!< UART1 transmit complete */
    kDmaRequestMux0UART2Rx = 6|0x100U, /*!< UART2 receive complete */
    kDmaRequestMux0UART2Tx = 7|0x100U, /*!< UART2 transmit complete */
    kDmaRequestMux0UART3Rx = 8|0x100U, /*!< UART3 receive complete */
    kDmaRequestMux0UART3Tx = 9|0x100U, /*!< UART3 transmit complete */
    kDmaRequestMux0Reserved10 = 10|0x100U, /*!< Reserved10 */
    kDmaRequestMux0Reserved11 = 11|0x100U, /*!< Reserved11 */
    kDmaRequestMux0Reserved12 = 12|0x100U, /*!< Reserved12 */
    kDmaRequestMux0Reserved13 = 13|0x100U, /*!< Reserved13 */
    kDmaRequestMux0I2S0Rx = 14|0x100U, /*!< I2S0 receive complete */
    kDmaRequestMux0I2S0Tx = 15|0x100U, /*!< I2S0 transmit complete */
    kDmaRequestMux0SPI0Rx = 16|0x100U, /*!< SPI0 receive complete */
    kDmaRequestMux0SPI0Tx = 17|0x100U, /*!< SPI0 transmit complete */
    kDmaRequestMux0SPI1Rx = 18|0x100U, /*!< SPI1 receive complete */
    kDmaRequestMux0SPI1Tx = 19|0x100U, /*!< SPI1 transmit complete */
    kDmaRequestMux0Reserved20 = 20|0x100U, /*!< Reserved20 */
    kDmaRequestMux0Reserved21 = 21|0x100U, /*!< Reserved21 */
    kDmaRequestMux0I2C0 = 22|0x100U, /*!< I2C0 transmission complete */
    kDmaRequestMux0I2C1 = 23|0x100U, /*!< I2C1 transmission complete */
    kDmaRequestMux0FTM0Channel0 = 24|0x100U, /*!< FTM0 channel 0 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel1 = 25|0x100U, /*!< FTM0 channel 1 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel2 = 26|0x100U, /*!< FTM0 channel 2 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel3 = 27|0x100U, /*!< FTM0 channel 3 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel4 = 28|0x100U, /*!< FTM0 channel 4 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel5 = 29|0x100U, /*!< FTM0 channel 5 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel6 = 30|0x100U, /*!< FTM0 channel 6 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel7 = 31|0x100U, /*!< FTM0 channel 7 event (CMP or CAP) */
    kDmaRequestMux0FTM1Channel0 = 32|0x100U, /*!< FTM1 channel 0 event (CMP or CAP) */
    kDmaRequestMux0FTM1Channel1 = 33|0x100U, /*!< FTM1 channel 1 event (CMP or CAP) */
    kDmaRequestMux0FTM2Channel0 = 34|0x100U, /*!< FTM2 channel 0 event (CMP or CAP) */
    kDmaRequestMux0FTM2Channel1 = 35|0x100U, /*!< FTM2 channel 1 event (CMP or CAP) */
    kDmaRequestMux0Reserved36 = 36|0x100U, /*!< Reserved36 */
    kDmaRequestMux0Reserved37 = 37|0x100U, /*!< Reserved37 */
    kDmaRequestMux0Reserved38 = 38|0x100U, /*!< Reserved38 */
    kDmaRequestMux0Reserved39 = 39|0x100U, /*!< Reserved39 */
    kDmaRequestMux0ADC0 = 40|0x100U, /*!< ADC0 conversion complete */
    kDmaRequestMux0ADC1 = 41|0x100U, /*!< ADC1 conversion complete */
    kDmaRequestMux0CMP0 = 42|0x100U, /*!< CMP0 Output */
    kDmaRequestMux0CMP1 = 43|0x100U, /*!< CMP1 Output */
    kDmaRequestMux0CMP2 = 44|0x100U, /*!< CMP2 Output */
    kDmaRequestMux0DAC0 = 45|0x100U, /*!< DAC0 buffer pointer reaches upper or lower limit */
    kDmaRequestMux0DAC1 = 46|0x100U, /*!< DAC1 buffer pointer reaches upper or lower limit */
    kDmaRequestMux0CMT = 47|0x100U, /*!< CMT end of modulation cycle event */
    kDmaRequestMux0PDB0 = 48|0x100U, /*!< PDB0 programmable interrupt delay event */
    kDmaRequestMux0PortA = 49|0x100U, /*!< PORTA rising, falling or both edges */
    kDmaRequestMux0PortB = 50|0x100U, /*!< PORTB rising, falling or both edges */
    kDmaRequestMux0PortC = 51|0x100U, /*!< PORTC rising, falling or both edges */
    kDmaRequestMux0PortD = 52|0x100U, /*!< PORTD rising, falling or both edges */
    kDmaRequestMux0Reserved53 = 53|0x100U, /*!< Reserved53 */
    kDmaRequestMux0AlwaysOn54 = 54|0x100U, /*!< Always enabled 54 */
    kDmaRequestMux0AlwaysOn55 = 55|0x100U, /*!< Always enabled 55 */
    kDmaRequestMux0AlwaysOn56 = 56|0x100U, /*!< Always enabled 56 */
    kDmaRequestMux0AlwaysOn57 = 57|0x100U, /*!< Always enabled 57 */
    kDmaRequestMux0AlwaysOn58 = 58|0x100U, /*!< Always enabled 58 */
    kDmaRequestMux0AlwaysOn59 = 59|0x100U, /*!< Always enabled 59 */
    kDmaRequestMux0AlwaysOn60 = 60|0x100U, /*!< Always enabled 60 */
    kDmaRequestMux0AlwaysOn61 = 61|0x100U, /*!< Always enabled 61 */
    kDmaRequestMux0AlwaysOn62 = 62|0x100U, /*!< Always enabled 62 */
    kDmaRequestMux0AlwaysOn63 = 63|0x100U, /*!< Always enabled 63 */
#elif defined(CPU_MK51DX256CLL10) || defined(CPU_MK51DN512CLL10)
    kDmaRequestMux0Disable = 0|0x100U, /*!< Disable */
    kDmaRequestMux0Reserved1 = 1|0x100U, /*!< Reserved1 */
    kDmaRequestMux0UART0Rx = 2|0x100U, /*!< UART0 receive complete */
    kDmaRequestMux0UART0Tx = 3|0x100U, /*!< UART0 transmit complete */
    kDmaRequestMux0UART1Rx = 4|0x100U, /*!< UART1 receive complete */
    kDmaRequestMux0UART1Tx = 5|0x100U, /*!< UART1 transmit complete */
    kDmaRequestMux0UART2Rx = 6|0x100U, /*!< UART2 receive complete */
    kDmaRequestMux0UART2Tx = 7|0x100U, /*!< UART2 transmit complete */
    kDmaRequestMux0UART3Rx = 8|0x100U, /*!< UART3 receive complete */
    kDmaRequestMux0UART3Tx = 9|0x100U, /*!< UART3 transmit complete */
    kDmaRequestMux0Reserved10 = 10|0x100U, /*!< Reserved10 */
    kDmaRequestMux0Reserved11 = 11|0x100U, /*!< Reserved11 */
    kDmaRequestMux0Reserved12 = 12|0x100U, /*!< Reserved12 */
    kDmaRequestMux0Reserved13 = 13|0x100U, /*!< Reserved13 */
    kDmaRequestMux0I2S0Rx = 14|0x100U, /*!< I2S0 receive complete */
    kDmaRequestMux0I2S0Tx = 15|0x100U, /*!< I2S0 transmit complete */
    kDmaRequestMux0SPI0Rx = 16|0x100U, /*!< SPI0 receive complete */
    kDmaRequestMux0SPI0Tx = 17|0x100U, /*!< SPI0 transmit complete */
    kDmaRequestMux0SPI1Rx = 18|0x100U, /*!< SPI1 receive complete */
    kDmaRequestMux0SPI1Tx = 19|0x100U, /*!< SPI1 transmit complete */
    kDmaRequestMux0SPI2Rx = 20|0x100U, /*!< SPI2 receive complete */
    kDmaRequestMux0SPI2Tx = 21|0x100U, /*!< SPI2 transmit complete */
    kDmaRequestMux0I2C0 = 22|0x100U, /*!< I2C0 transmission complete */
    kDmaRequestMux0I2C1 = 23|0x100U, /*!< I2C1 transmission complete */
    kDmaRequestMux0FTM0Channel0 = 24|0x100U, /*!< FTM0 channel 0 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel1 = 25|0x100U, /*!< FTM0 channel 1 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel2 = 26|0x100U, /*!< FTM0 channel 2 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel3 = 27|0x100U, /*!< FTM0 channel 3 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel4 = 28|0x100U, /*!< FTM0 channel 4 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel5 = 29|0x100U, /*!< FTM0 channel 5 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel6 = 30|0x100U, /*!< FTM0 channel 6 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel7 = 31|0x100U, /*!< FTM0 channel 7 event (CMP or CAP) */
    kDmaRequestMux0FTM1Channel0 = 32|0x100U, /*!< FTM1 channel 0 event (CMP or CAP) */
    kDmaRequestMux0FTM1Channel1 = 33|0x100U, /*!< FTM1 channel 1 event (CMP or CAP) */
    kDmaRequestMux0FTM2Channel0 = 34|0x100U, /*!< FTM2 channel 0 event (CMP or CAP) */
    kDmaRequestMux0FTM2Channel1 = 35|0x100U, /*!< FTM2 channel 1 event (CMP or CAP) */
    kDmaRequestMux0Reserved36 = 36|0x100U, /*!< Reserved36 */
    kDmaRequestMux0Reserved37 = 37|0x100U, /*!< Reserved37 */
    kDmaRequestMux0Reserved38 = 38|0x100U, /*!< Reserved38 */
    kDmaRequestMux0Reserved39 = 39|0x100U, /*!< Reserved39 */
    kDmaRequestMux0ADC0 = 40|0x100U, /*!< ADC0 conversion complete */
    kDmaRequestMux0ADC1 = 41|0x100U, /*!< ADC1 conversion complete */
    kDmaRequestMux0CMP0 = 42|0x100U, /*!< CMP0 Output */
    kDmaRequestMux0CMP1 = 43|0x100U, /*!< CMP1 Output */
    kDmaRequestMux0CMP2 = 44|0x100U, /*!< CMP2 Output */
    kDmaRequestMux0DAC0 = 45|0x100U, /*!< DAC0 buffer pointer reaches upper or lower limit */
    kDmaRequestMux0DAC1 = 46|0x100U, /*!< DAC1 buffer pointer reaches upper or lower limit */
    kDmaRequestMux0CMT = 47|0x100U, /*!< CMT end of modulation cycle event */
    kDmaRequestMux0PDB0 = 48|0x100U, /*!< PDB0 programmable interrupt delay event */
    kDmaRequestMux0PortA = 49|0x100U, /*!< PORTA rising, falling or both edges */
    kDmaRequestMux0PortB = 50|0x100U, /*!< PORTB rising, falling or both edges */
    kDmaRequestMux0PortC = 51|0x100U, /*!< PORTC rising, falling or both edges */
    kDmaRequestMux0PortD = 52|0x100U, /*!< PORTD rising, falling or both edges */
    kDmaRequestMux0PortE = 53|0x100U, /*!< PORTE rising, falling or both edges */
    kDmaRequestMux0AlwaysOn54 = 54|0x100U, /*!< Always enabled 54 */
    kDmaRequestMux0AlwaysOn55 = 55|0x100U, /*!< Always enabled 55 */
    kDmaRequestMux0AlwaysOn56 = 56|0x100U, /*!< Always enabled 56 */
    kDmaRequestMux0AlwaysOn57 = 57|0x100U, /*!< Always enabled 57 */
    kDmaRequestMux0AlwaysOn58 = 58|0x100U, /*!< Always enabled 58 */
    kDmaRequestMux0AlwaysOn59 = 59|0x100U, /*!< Always enabled 59 */
    kDmaRequestMux0AlwaysOn60 = 60|0x100U, /*!< Always enabled 60 */
    kDmaRequestMux0AlwaysOn61 = 61|0x100U, /*!< Always enabled 61 */
    kDmaRequestMux0AlwaysOn62 = 62|0x100U, /*!< Always enabled 62 */
    kDmaRequestMux0AlwaysOn63 = 63|0x100U, /*!< Always enabled 63 */
#elif defined(CPU_MK52DN512CLQ10) || defined(CPU_MK52DN512CMD10) || defined(CPU_MK53DN512CLQ10) || defined(CPU_MK53DX256CLQ10) || \
    defined(CPU_MK53DN512CMD10) || defined(CPU_MK53DX256CMD10) || defined(CPU_MK60DN256VLQ10) || defined(CPU_MK60DX256VLQ10) || \
    defined(CPU_MK60DN512VLQ10) || defined(CPU_MK60DN256VMC10) || defined(CPU_MK60DX256VMC10) || defined(CPU_MK60DN512VMC10) || \
    defined(CPU_MK60DN256VMD10) || defined(CPU_MK60DX256VMD10) || defined(CPU_MK60DN512VMD10)
    kDmaRequestMux0Disable = 0|0x100U, /*!< Disable */
    kDmaRequestMux0Reserved1 = 1|0x100U, /*!< Reserved1 */
    kDmaRequestMux0UART0Rx = 2|0x100U, /*!< UART0 receive complete */
    kDmaRequestMux0UART0Tx = 3|0x100U, /*!< UART0 transmit complete */
    kDmaRequestMux0UART1Rx = 4|0x100U, /*!< UART1 receive complete */
    kDmaRequestMux0UART1Tx = 5|0x100U, /*!< UART1 transmit complete */
    kDmaRequestMux0UART2Rx = 6|0x100U, /*!< UART2 receive complete */
    kDmaRequestMux0UART2Tx = 7|0x100U, /*!< UART2 transmit complete */
    kDmaRequestMux0UART3Rx = 8|0x100U, /*!< UART3 receive complete */
    kDmaRequestMux0UART3Tx = 9|0x100U, /*!< UART3 transmit complete */
    kDmaRequestMux0UART4Rx = 10|0x100U, /*!< UART4 receive complete */
    kDmaRequestMux0UART4Tx = 11|0x100U, /*!< UART4 transmit complete */
    kDmaRequestMux0UART5Rx = 12|0x100U, /*!< UART5 receive complete */
    kDmaRequestMux0UART5Tx = 13|0x100U, /*!< UART5 transmit complete */
    kDmaRequestMux0I2S0Rx = 14|0x100U, /*!< I2S0 receive complete */
    kDmaRequestMux0I2S0Tx = 15|0x100U, /*!< I2S0 transmit complete */
    kDmaRequestMux0SPI0Rx = 16|0x100U, /*!< SPI0 receive complete */
    kDmaRequestMux0SPI0Tx = 17|0x100U, /*!< SPI0 transmit complete */
    kDmaRequestMux0SPI1Rx = 18|0x100U, /*!< SPI1 receive complete */
    kDmaRequestMux0SPI1Tx = 19|0x100U, /*!< SPI1 transmit complete */
    kDmaRequestMux0SPI2Rx = 20|0x100U, /*!< SPI2 receive complete */
    kDmaRequestMux0SPI2Tx = 21|0x100U, /*!< SPI2 transmit complete */
    kDmaRequestMux0I2C0 = 22|0x100U, /*!< I2C0 transmission complete */
    kDmaRequestMux0I2C1 = 23|0x100U, /*!< I2C1 transmission complete */
    kDmaRequestMux0FTM0Channel0 = 24|0x100U, /*!< FTM0 channel 0 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel1 = 25|0x100U, /*!< FTM0 channel 1 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel2 = 26|0x100U, /*!< FTM0 channel 2 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel3 = 27|0x100U, /*!< FTM0 channel 3 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel4 = 28|0x100U, /*!< FTM0 channel 4 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel5 = 29|0x100U, /*!< FTM0 channel 5 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel6 = 30|0x100U, /*!< FTM0 channel 6 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel7 = 31|0x100U, /*!< FTM0 channel 7 event (CMP or CAP) */
    kDmaRequestMux0FTM1Channel0 = 32|0x100U, /*!< FTM1 channel 0 event (CMP or CAP) */
    kDmaRequestMux0FTM1Channel1 = 33|0x100U, /*!< FTM1 channel 1 event (CMP or CAP) */
    kDmaRequestMux0FTM2Channel0 = 34|0x100U, /*!< FTM2 channel 0 event (CMP or CAP) */
    kDmaRequestMux0FTM2Channel1 = 35|0x100U, /*!< FTM2 channel 1 event (CMP or CAP) */
    kDmaRequestMux0IEEE1588Timer0 = 36|0x100U, /*!< Ethernet IEEE 1588 timer 0 */
    kDmaRequestMux0IEEE1588Timer1 = 37|0x100U, /*!< Ethernet IEEE 1588 timer 1 */
    kDmaRequestMux0IEEE1588Timer2 = 38|0x100U, /*!< Ethernet IEEE 1588 timer 2 */
    kDmaRequestMux0IEEE1588Timer3 = 39|0x100U, /*!< Ethernet IEEE 1588 timer 3 */
    kDmaRequestMux0ADC0 = 40|0x100U, /*!< ADC0 conversion complete */
    kDmaRequestMux0ADC1 = 41|0x100U, /*!< ADC1 conversion complete */
    kDmaRequestMux0CMP0 = 42|0x100U, /*!< CMP0 Output */
    kDmaRequestMux0CMP1 = 43|0x100U, /*!< CMP1 Output */
    kDmaRequestMux0CMP2 = 44|0x100U, /*!< CMP2 Output */
    kDmaRequestMux0DAC0 = 45|0x100U, /*!< DAC0 buffer pointer reaches upper or lower limit */
    kDmaRequestMux0DAC1 = 46|0x100U, /*!< DAC1 buffer pointer reaches upper or lower limit */
    kDmaRequestMux0CMT = 47|0x100U, /*!< CMT end of modulation cycle event */
    kDmaRequestMux0PDB0 = 48|0x100U, /*!< PDB0 programmable interrupt delay event */
    kDmaRequestMux0PortA = 49|0x100U, /*!< PORTA rising, falling or both edges */
    kDmaRequestMux0PortB = 50|0x100U, /*!< PORTB rising, falling or both edges */
    kDmaRequestMux0PortC = 51|0x100U, /*!< PORTC rising, falling or both edges */
    kDmaRequestMux0PortD = 52|0x100U, /*!< PORTD rising, falling or both edges */
    kDmaRequestMux0PortE = 53|0x100U, /*!< PORTE rising, falling or both edges */
    kDmaRequestMux0AlwaysOn54 = 54|0x100U, /*!< Always enabled 54 */
    kDmaRequestMux0AlwaysOn55 = 55|0x100U, /*!< Always enabled 55 */
    kDmaRequestMux0AlwaysOn56 = 56|0x100U, /*!< Always enabled 56 */
    kDmaRequestMux0AlwaysOn57 = 57|0x100U, /*!< Always enabled 57 */
    kDmaRequestMux0AlwaysOn58 = 58|0x100U, /*!< Always enabled 58 */
    kDmaRequestMux0AlwaysOn59 = 59|0x100U, /*!< Always enabled 59 */
    kDmaRequestMux0AlwaysOn60 = 60|0x100U, /*!< Always enabled 60 */
    kDmaRequestMux0AlwaysOn61 = 61|0x100U, /*!< Always enabled 61 */
    kDmaRequestMux0AlwaysOn62 = 62|0x100U, /*!< Always enabled 62 */
    kDmaRequestMux0AlwaysOn63 = 63|0x100U, /*!< Always enabled 63 */
#elif defined(CPU_MK60DN256VLL10) || defined(CPU_MK60DX256VLL10) || defined(CPU_MK60DN512VLL10)
    kDmaRequestMux0Disable = 0|0x100U, /*!< Disable */
    kDmaRequestMux0Reserved1 = 1|0x100U, /*!< Reserved1 */
    kDmaRequestMux0UART0Rx = 2|0x100U, /*!< UART0 receive complete */
    kDmaRequestMux0UART0Tx = 3|0x100U, /*!< UART0 transmit complete */
    kDmaRequestMux0UART1Rx = 4|0x100U, /*!< UART1 receive complete */
    kDmaRequestMux0UART1Tx = 5|0x100U, /*!< UART1 transmit complete */
    kDmaRequestMux0UART2Rx = 6|0x100U, /*!< UART2 receive complete */
    kDmaRequestMux0UART2Tx = 7|0x100U, /*!< UART2 transmit complete */
    kDmaRequestMux0UART3Rx = 8|0x100U, /*!< UART3 receive complete */
    kDmaRequestMux0UART3Tx = 9|0x100U, /*!< UART3 transmit complete */
    kDmaRequestMux0UART4Rx = 10|0x100U, /*!< UART4 receive complete */
    kDmaRequestMux0UART4Tx = 11|0x100U, /*!< UART4 transmit complete */
    kDmaRequestMux0Reserved12 = 12|0x100U, /*!< Reserved12 */
    kDmaRequestMux0Reserved13 = 13|0x100U, /*!< Reserved13 */
    kDmaRequestMux0I2S0Rx = 14|0x100U, /*!< I2S0 receive complete */
    kDmaRequestMux0I2S0Tx = 15|0x100U, /*!< I2S0 transmit complete */
    kDmaRequestMux0SPI0Rx = 16|0x100U, /*!< SPI0 receive complete */
    kDmaRequestMux0SPI0Tx = 17|0x100U, /*!< SPI0 transmit complete */
    kDmaRequestMux0SPI1Rx = 18|0x100U, /*!< SPI1 receive complete */
    kDmaRequestMux0SPI1Tx = 19|0x100U, /*!< SPI1 transmit complete */
    kDmaRequestMux0SPI2Rx = 20|0x100U, /*!< SPI2 receive complete */
    kDmaRequestMux0SPI2Tx = 21|0x100U, /*!< SPI2 transmit complete */
    kDmaRequestMux0I2C0 = 22|0x100U, /*!< I2C0 transmission complete */
    kDmaRequestMux0I2C1 = 23|0x100U, /*!< I2C1 transmission complete */
    kDmaRequestMux0FTM0Channel0 = 24|0x100U, /*!< FTM0 channel 0 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel1 = 25|0x100U, /*!< FTM0 channel 1 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel2 = 26|0x100U, /*!< FTM0 channel 2 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel3 = 27|0x100U, /*!< FTM0 channel 3 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel4 = 28|0x100U, /*!< FTM0 channel 4 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel5 = 29|0x100U, /*!< FTM0 channel 5 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel6 = 30|0x100U, /*!< FTM0 channel 6 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel7 = 31|0x100U, /*!< FTM0 channel 7 event (CMP or CAP) */
    kDmaRequestMux0FTM1Channel0 = 32|0x100U, /*!< FTM1 channel 0 event (CMP or CAP) */
    kDmaRequestMux0FTM1Channel1 = 33|0x100U, /*!< FTM1 channel 1 event (CMP or CAP) */
    kDmaRequestMux0FTM2Channel0 = 34|0x100U, /*!< FTM2 channel 0 event (CMP or CAP) */
    kDmaRequestMux0FTM2Channel1 = 35|0x100U, /*!< FTM2 channel 1 event (CMP or CAP) */
    kDmaRequestMux0IEEE1588Timer0 = 36|0x100U, /*!< Ethernet IEEE 1588 timer 0 */
    kDmaRequestMux0IEEE1588Timer1 = 37|0x100U, /*!< Ethernet IEEE 1588 timer 1 */
    kDmaRequestMux0IEEE1588Timer2 = 38|0x100U, /*!< Ethernet IEEE 1588 timer 2 */
    kDmaRequestMux0IEEE1588Timer3 = 39|0x100U, /*!< Ethernet IEEE 1588 timer 3 */
    kDmaRequestMux0ADC0 = 40|0x100U, /*!< ADC0 conversion complete */
    kDmaRequestMux0ADC1 = 41|0x100U, /*!< ADC1 conversion complete */
    kDmaRequestMux0CMP0 = 42|0x100U, /*!< CMP0 Output */
    kDmaRequestMux0CMP1 = 43|0x100U, /*!< CMP1 Output */
    kDmaRequestMux0CMP2 = 44|0x100U, /*!< CMP2 Output */
    kDmaRequestMux0DAC0 = 45|0x100U, /*!< DAC0 buffer pointer reaches upper or lower limit */
    kDmaRequestMux0Reserved46 = 46|0x100U, /*!< Reserved46 */
    kDmaRequestMux0CMT = 47|0x100U, /*!< CMT end of modulation cycle event */
    kDmaRequestMux0PDB0 = 48|0x100U, /*!< PDB0 programmable interrupt delay event */
    kDmaRequestMux0PortA = 49|0x100U, /*!< PORTA rising, falling or both edges */
    kDmaRequestMux0PortB = 50|0x100U, /*!< PORTB rising, falling or both edges */
    kDmaRequestMux0PortC = 51|0x100U, /*!< PORTC rising, falling or both edges */
    kDmaRequestMux0PortD = 52|0x100U, /*!< PORTD rising, falling or both edges */
    kDmaRequestMux0PortE = 53|0x100U, /*!< PORTE rising, falling or both edges */
    kDmaRequestMux0AlwaysOn54 = 54|0x100U, /*!< Always enabled 54 */
    kDmaRequestMux0AlwaysOn55 = 55|0x100U, /*!< Always enabled 55 */
    kDmaRequestMux0AlwaysOn56 = 56|0x100U, /*!< Always enabled 56 */
    kDmaRequestMux0AlwaysOn57 = 57|0x100U, /*!< Always enabled 57 */
    kDmaRequestMux0AlwaysOn58 = 58|0x100U, /*!< Always enabled 58 */
    kDmaRequestMux0AlwaysOn59 = 59|0x100U, /*!< Always enabled 59 */
    kDmaRequestMux0AlwaysOn60 = 60|0x100U, /*!< Always enabled 60 */
    kDmaRequestMux0AlwaysOn61 = 61|0x100U, /*!< Always enabled 61 */
    kDmaRequestMux0AlwaysOn62 = 62|0x100U, /*!< Always enabled 62 */
    kDmaRequestMux0AlwaysOn63 = 63|0x100U, /*!< Always enabled 63 */
#elif defined(CPU_MK63FN1M0VLQ12WS) || defined(CPU_MK63FN1M0VLQ12) || defined(CPU_MK63FN1M0VMD12WS) || defined(CPU_MK63FN1M0VMD12) || \
    defined(CPU_MK64FX512VDC12) || defined(CPU_MK64FN1M0VDC12) || defined(CPU_MK64FX512VLQ12) || defined(CPU_MK64FN1M0VLQ12) || \
    defined(CPU_MK64FX512VMD12) || defined(CPU_MK64FN1M0VMD12)
    kDmaRequestMux0Disable = 0|0x100U, /*!< DMAMUX TriggerDisabled. */
    kDmaRequestMux0Reserved1 = 1|0x100U, /*!< Reserved1 */
    kDmaRequestMux0UART0Rx = 2|0x100U, /*!< UART0 Receive. */
    kDmaRequestMux0UART0Tx = 3|0x100U, /*!< UART0 Transmit. */
    kDmaRequestMux0UART1Rx = 4|0x100U, /*!< UART1 Receive. */
    kDmaRequestMux0UART1Tx = 5|0x100U, /*!< UART1 Transmit. */
    kDmaRequestMux0UART2Rx = 6|0x100U, /*!< UART2 Receive. */
    kDmaRequestMux0UART2Tx = 7|0x100U, /*!< UART2 Transmit. */
    kDmaRequestMux0UART3Rx = 8|0x100U, /*!< UART3 Receive. */
    kDmaRequestMux0UART3Tx = 9|0x100U, /*!< UART3 Transmit. */
