m-okada/QV08/emu/ARM/kinetis_workspace/t03/SDK/platform/drivers/inc/fsl_edma_request.h
    kDmaRequestMux0Reserved33 = 33|0x100U, /*!< Reserved33 */
    kDmaRequestMux0CMP0 = 34|0x100U, /*!< CMP0 output */
    kDmaRequestMux0Reserved35 = 35|0x100U, /*!< Reserved35 */
    kDmaRequestMux0Reserved36 = 36|0x100U, /*!< Reserved36 */
    kDmaRequestMux0Reserved37 = 37|0x100U, /*!< Reserved37 */
    kDmaRequestMux0Reserved38 = 38|0x100U, /*!< Reserved38 */
    kDmaRequestMux0Reserved39 = 39|0x100U, /*!< Reserved39 */
    kDmaRequestMux0ADCA = 40|0x100U, /*!< ADC converter A end of scan */
    kDmaRequestMux0ADCB = 41|0x100U, /*!< ADC converter B end of scan */
    kDmaRequestMux0CMP1 = 42|0x100U, /*!< CMP1 output */
    kDmaRequestMux0CMP2 = 43|0x100U, /*!< CMP2 output */
    kDmaRequestMux0CMP3 = 44|0x100U, /*!< CMP3 output */
    kDmaRequestMux0Reserved45 = 45|0x100U, /*!< Reserved45 */
    kDmaRequestMux0Reserved46 = 46|0x100U, /*!< Reserved46 */
    kDmaRequestMux0PDB0 = 47|0x100U, /*!< PDB0 channel 0 output trigger */
    kDmaRequestMux0PDB1 = 48|0x100U, /*!< PDB1 channel 0 output trigger */
    kDmaRequestMux0PortA = 49|0x100U, /*!< PORTA rising, falling or both edges */
    kDmaRequestMux0PortB = 50|0x100U, /*!< PORTB rising, falling or both edges */
    kDmaRequestMux0PortC = 51|0x100U, /*!< PORTC rising, falling or both edges */
    kDmaRequestMux0PortD = 52|0x100U, /*!< PORTD rising, falling or both edges */
    kDmaRequestMux0PortE = 53|0x100U, /*!< PORTE rising, falling or both edges */
    kDmaRequestMux0Reserved54 = 54|0x100U, /*!< Reserved54 */
    kDmaRequestMux0Reserved55 = 55|0x100U, /*!< Reserved55 */
    kDmaRequestMux0Reserved56 = 56|0x100U, /*!< Reserved56 */
    kDmaRequestMux0Reserved57 = 57|0x100U, /*!< Reserved57 */
    kDmaRequestMux0AlwaysOn58 = 58|0x100U, /*!< Slot 58 is always enabled */
    kDmaRequestMux0AlwaysOn59 = 59|0x100U, /*!< Slot 59 is always enabled */
    kDmaRequestMux0AlwaysOn60 = 60|0x100U, /*!< Slot 60 is always enabled */
    kDmaRequestMux0AlwaysOn61 = 61|0x100U, /*!< Slot 61 is always enabled */
    kDmaRequestMux0AlwaysOn62 = 62|0x100U, /*!< Slot 62 is always enabled */
    kDmaRequestMux0AlwaysOn63 = 63|0x100U, /*!< Slot 63 is always enabled */
#elif defined(CPU_MKV44F128VLH15) || defined(CPU_MKV44F128VLL15) || defined(CPU_MKV44F64VLH15)
    kDmaRequestMux0Disable = 0|0x100U, /*!< DMA requests are disabled. */
    kDmaRequestMux0Reserved1 = 1|0x100U, /*!< Reserved1 */
    kDmaRequestMux0UART0Rx = 2|0x100U, /*!< UART0 receive complete */
    kDmaRequestMux0UART0Tx = 3|0x100U, /*!< UART0 transmit complete */
    kDmaRequestMux0UART1Rx = 4|0x100U, /*!< UART1 receive complete */
    kDmaRequestMux0UART1Tx = 5|0x100U, /*!< UART1 transmit complete */
    kDmaRequestMux0PWMA0WR = 6|0x100U, /*!< PWMA submodule 0 write request on beginning of reload cycle */
    kDmaRequestMux0PWMA1WR = 7|0x100U, /*!< PWMA submodule 1 write request on beginning of reload cycle */
    kDmaRequestMux0PWMA2WR = 8|0x100U, /*!< PWMA submodule 2 write request on beginning of reload cycle */
    kDmaRequestMux0PWMA3WR = 9|0x100U, /*!< PWMA submodule 3 write request on beginning of reload cycle */
    kDmaRequestMux0PWMA0CP = 10|0x100U, /*!< PWMA submodule 0 read request on capture FIFO marker */
    kDmaRequestMux0PWMA1CP = 11|0x100U, /*!< PWMA submodule 1 read request on capture FIFO marker */
    kDmaRequestMux0PWMA2CP = 12|0x100U, /*!< PWMA submodule 2 read request on capture FIFO marker */
    kDmaRequestMux0PWMA3CP = 13|0x100U, /*!< PWMA submodule 3 read request on capture FIFO marker */
    kDmaRequestMux0CAN0Rx = 14|0x100U, /*!< CAN0 reach receiever mailbox level */
    kDmaRequestMux0Reserved15 = 15|0x100U, /*!< Reserved15 */
    kDmaRequestMux0SPI0Rx = 16|0x100U, /*!< SPI receive complete */
    kDmaRequestMux0SPI0Tx = 17|0x100U, /*!< SPI transmit complete */
    kDmaRequestMux0XBARAOut0 = 18|0x100U, /*!< XBARA output 0 */
    kDmaRequestMux0XBARAOut1 = 19|0x100U, /*!< XBARA output 1 */
    kDmaRequestMux0XBARAOut2 = 20|0x100U, /*!< XBARA output 2 */
    kDmaRequestMux0XBARAOut3 = 21|0x100U, /*!< XBARA output 3 */
    kDmaRequestMux0I2C0 = 22|0x100U, /*!< I2C transmission complete */
    kDmaRequestMux0Reserved23 = 23|0x100U, /*!< Reserved23 */
    kDmaRequestMux0Reserved24 = 24|0x100U, /*!< Reserved24 */
    kDmaRequestMux0Reserved25 = 25|0x100U, /*!< Reserved25 */
    kDmaRequestMux0Reserved26 = 26|0x100U, /*!< Reserved26 */
    kDmaRequestMux0Reserved27 = 27|0x100U, /*!< Reserved27 */
    kDmaRequestMux0Reserved28 = 28|0x100U, /*!< Reserved28 */
    kDmaRequestMux0Reserved29 = 29|0x100U, /*!< Reserved29 */
    kDmaRequestMux0Reserved30 = 30|0x100U, /*!< Reserved30 */
    kDmaRequestMux0Reserved31 = 31|0x100U, /*!< Reserved31 */
    kDmaRequestMux0Reserved32 = 32|0x100U, /*!< Reserved32 */
    kDmaRequestMux0Reserved33 = 33|0x100U, /*!< Reserved33 */
    kDmaRequestMux0CMP0 = 34|0x100U, /*!< CMP0 output */
    kDmaRequestMux0Reserved35 = 35|0x100U, /*!< Reserved35 */
    kDmaRequestMux0Reserved36 = 36|0x100U, /*!< Reserved36 */
    kDmaRequestMux0Reserved37 = 37|0x100U, /*!< Reserved37 */
    kDmaRequestMux0Reserved38 = 38|0x100U, /*!< Reserved38 */
    kDmaRequestMux0Reserved39 = 39|0x100U, /*!< Reserved39 */
    kDmaRequestMux0ADCA = 40|0x100U, /*!< ADC converter A end of scan */
    kDmaRequestMux0ADCB = 41|0x100U, /*!< ADC converter B end of scan */
    kDmaRequestMux0CMP1 = 42|0x100U, /*!< CMP1 output */
    kDmaRequestMux0CMP2 = 43|0x100U, /*!< CMP2 output */
    kDmaRequestMux0CMP3 = 44|0x100U, /*!< CMP3 output */
    kDmaRequestMux0DAC0 = 45|0x100U, /*!< DAC buffer pointer reaches upper or lower limit */
    kDmaRequestMux0Reserved46 = 46|0x100U, /*!< Reserved46 */
    kDmaRequestMux0PDB0 = 47|0x100U, /*!< PDB0 channel 0 output trigger */
    kDmaRequestMux0PDB1 = 48|0x100U, /*!< PDB1 channel 0 output trigger */
    kDmaRequestMux0PortA = 49|0x100U, /*!< PORTA rising, falling or both edges */
    kDmaRequestMux0PortB = 50|0x100U, /*!< PORTB rising, falling or both edges */
    kDmaRequestMux0PortC = 51|0x100U, /*!< PORTC rising, falling or both edges */
    kDmaRequestMux0PortD = 52|0x100U, /*!< PORTD rising, falling or both edges */
    kDmaRequestMux0PortE = 53|0x100U, /*!< PORTE rising, falling or both edges */
    kDmaRequestMux0Reserved54 = 54|0x100U, /*!< Reserved54 */
    kDmaRequestMux0Reserved55 = 55|0x100U, /*!< Reserved55 */
    kDmaRequestMux0Reserved56 = 56|0x100U, /*!< Reserved56 */
    kDmaRequestMux0Reserved57 = 57|0x100U, /*!< Reserved57 */
    kDmaRequestMux0AlwaysOn58 = 58|0x100U, /*!< Slot 58 is always enabled */
    kDmaRequestMux0AlwaysOn59 = 59|0x100U, /*!< Slot 59 is always enabled */
    kDmaRequestMux0AlwaysOn60 = 60|0x100U, /*!< Slot 60 is always enabled */
    kDmaRequestMux0AlwaysOn61 = 61|0x100U, /*!< Slot 61 is always enabled */
    kDmaRequestMux0AlwaysOn62 = 62|0x100U, /*!< Slot 62 is always enabled */
    kDmaRequestMux0AlwaysOn63 = 63|0x100U, /*!< Slot 63 is always enabled */
#elif defined(CPU_MKV45F128VLH15) || defined(CPU_MKV45F256VLH15)
    kDmaRequestMux0Disable = 0|0x100U, /*!< DMA requests are disabled. */
    kDmaRequestMux0Reserved1 = 1|0x100U, /*!< Reserved1 */
    kDmaRequestMux0UART0Rx = 2|0x100U, /*!< UART0 receive complete */
    kDmaRequestMux0UART0Tx = 3|0x100U, /*!< UART0 transmit complete */
    kDmaRequestMux0UART1Rx = 4|0x100U, /*!< UART1 receive complete */
    kDmaRequestMux0UART1Tx = 5|0x100U, /*!< UART1 transmit complete */
    kDmaRequestMux0PWMA0WR = 6|0x100U, /*!< PWMA submodule 0 write request on beginning of reload cycle */
    kDmaRequestMux0PWMA1WR = 7|0x100U, /*!< PWMA submodule 1 write request on beginning of reload cycle */
    kDmaRequestMux0PWMA2WR = 8|0x100U, /*!< PWMA submodule 2 write request on beginning of reload cycle */
    kDmaRequestMux0PWMA3WR = 9|0x100U, /*!< PWMA submodule 3 write request on beginning of reload cycle */
    kDmaRequestMux0PWMA0CP = 10|0x100U, /*!< PWMA submodule 0 read request on capture FIFO marker */
    kDmaRequestMux0PWMA1CP = 11|0x100U, /*!< PWMA submodule 1 read request on capture FIFO marker */
    kDmaRequestMux0PWMA2CP = 12|0x100U, /*!< PWMA submodule 2 read request on capture FIFO marker */
    kDmaRequestMux0PWMA3CP = 13|0x100U, /*!< PWMA submodule 3 read request on capture FIFO marker */
    kDmaRequestMux0CAN0Rx = 14|0x100U, /*!< CAN0 reach receiever mailbox level */
    kDmaRequestMux0Reserved15 = 15|0x100U, /*!< Reserved15 */
    kDmaRequestMux0SPI0Rx = 16|0x100U, /*!< SPI receive complete */
    kDmaRequestMux0SPI0Tx = 17|0x100U, /*!< SPI transmit complete */
    kDmaRequestMux0XBARAOut0 = 18|0x100U, /*!< XBARA output 0 */
    kDmaRequestMux0XBARAOut1 = 19|0x100U, /*!< XBARA output 1 */
    kDmaRequestMux0XBARAOut2 = 20|0x100U, /*!< XBARA output 2 */
    kDmaRequestMux0XBARAOut3 = 21|0x100U, /*!< XBARA output 3 */
    kDmaRequestMux0I2C0 = 22|0x100U, /*!< I2C transmission complete */
    kDmaRequestMux0Reserved23 = 23|0x100U, /*!< Reserved23 */
    kDmaRequestMux0FTM0Channel0 = 24|0x100U, /*!< FTM0 channel 0 event  (CMP or CAP) */
    kDmaRequestMux0FTM0Channel1 = 25|0x100U, /*!< FTM0 channel 1 event  (CMP or CAP) */
    kDmaRequestMux0FTM0Channel2 = 26|0x100U, /*!< FTM0 channel 2 event  (CMP or CAP) */
    kDmaRequestMux0FTM0Channel3 = 27|0x100U, /*!< FTM0 channel 3 event  (CMP or CAP) */
    kDmaRequestMux0FTM0Channel4 = 28|0x100U, /*!< FTM0 channel 4 event  (CMP or CAP) */
    kDmaRequestMux0FTM0Channel5 = 29|0x100U, /*!< FTM0 channel 5 event  (CMP or CAP) */
    kDmaRequestMux0FTM0Channel6 = 30|0x100U, /*!< FTM0 channel 6 event  (CMP or CAP) */
    kDmaRequestMux0FTM0Channel7 = 31|0x100U, /*!< FTM0 channel 7 event  (CMP or CAP) */
    kDmaRequestMux0FTM1Channel0 = 32|0x100U, /*!< FTM1 channel 0 event  (CMP or CAP) */
    kDmaRequestMux0FTM1Channel1 = 33|0x100U, /*!< FTM1 channel 1 event  (CMP or CAP) */
    kDmaRequestMux0CMP0 = 34|0x100U, /*!< CMP0 output */
    kDmaRequestMux0Reserved35 = 35|0x100U, /*!< Reserved35 */
    kDmaRequestMux0Reserved36 = 36|0x100U, /*!< Reserved36 */
    kDmaRequestMux0Reserved37 = 37|0x100U, /*!< Reserved37 */
    kDmaRequestMux0Reserved38 = 38|0x100U, /*!< Reserved38 */
    kDmaRequestMux0Reserved39 = 39|0x100U, /*!< Reserved39 */
    kDmaRequestMux0ADCA = 40|0x100U, /*!< ADC converter A end of scan */
    kDmaRequestMux0ADCB = 41|0x100U, /*!< ADC converter B end of scan */
    kDmaRequestMux0CMP1 = 42|0x100U, /*!< CMP1 output */
    kDmaRequestMux0CMP2 = 43|0x100U, /*!< CMP2 output */
    kDmaRequestMux0CMP3 = 44|0x100U, /*!< CMP3 output */
    kDmaRequestMux0Reserved45 = 45|0x100U, /*!< Reserved45 */
    kDmaRequestMux0Reserved46 = 46|0x100U, /*!< Reserved46 */
    kDmaRequestMux0PDB0 = 47|0x100U, /*!< PDB0 channel 0 output trigger */
    kDmaRequestMux0PDB1 = 48|0x100U, /*!< PDB1 channel 0 output trigger */
    kDmaRequestMux0PortA = 49|0x100U, /*!< PORTA rising, falling or both edges */
    kDmaRequestMux0PortB = 50|0x100U, /*!< PORTB rising, falling or both edges */
    kDmaRequestMux0PortC = 51|0x100U, /*!< PORTC rising, falling or both edges */
    kDmaRequestMux0PortD = 52|0x100U, /*!< PORTD rising, falling or both edges */
    kDmaRequestMux0PortE = 53|0x100U, /*!< PORTE rising, falling or both edges */
    kDmaRequestMux0Reserved54 = 54|0x100U, /*!< Reserved54 */
    kDmaRequestMux0Reserved55 = 55|0x100U, /*!< Reserved55 */
    kDmaRequestMux0Reserved56 = 56|0x100U, /*!< Reserved56 */
    kDmaRequestMux0Reserved57 = 57|0x100U, /*!< Reserved57 */
    kDmaRequestMux0AlwaysOn58 = 58|0x100U, /*!< Slot 58 is always enabled */
    kDmaRequestMux0AlwaysOn59 = 59|0x100U, /*!< Slot 59 is always enabled */
    kDmaRequestMux0AlwaysOn60 = 60|0x100U, /*!< Slot 60 is always enabled */
    kDmaRequestMux0AlwaysOn61 = 61|0x100U, /*!< Slot 61 is always enabled */
    kDmaRequestMux0AlwaysOn62 = 62|0x100U, /*!< Slot 62 is always enabled */
    kDmaRequestMux0AlwaysOn63 = 63|0x100U, /*!< Slot 63 is always enabled */
#elif defined(CPU_MKV45F128VLL15) || defined(CPU_MKV45F256VLL15)
    kDmaRequestMux0Disable = 0|0x100U, /*!< DMA requests are disabled. */
    kDmaRequestMux0Reserved1 = 1|0x100U, /*!< Reserved1 */
    kDmaRequestMux0UART0Rx = 2|0x100U, /*!< UART0 receive complete */
    kDmaRequestMux0UART0Tx = 3|0x100U, /*!< UART0 transmit complete */
    kDmaRequestMux0UART1Rx = 4|0x100U, /*!< UART1 receive complete */
    kDmaRequestMux0UART1Tx = 5|0x100U, /*!< UART1 transmit complete */
    kDmaRequestMux0PWMA0WR = 6|0x100U, /*!< PWMA submodule 0 write request on beginning of reload cycle */
    kDmaRequestMux0PWMA1WR = 7|0x100U, /*!< PWMA submodule 1 write request on beginning of reload cycle */
    kDmaRequestMux0PWMA2WR = 8|0x100U, /*!< PWMA submodule 2 write request on beginning of reload cycle */
    kDmaRequestMux0PWMA3WR = 9|0x100U, /*!< PWMA submodule 3 write request on beginning of reload cycle */
    kDmaRequestMux0PWMA0CP = 10|0x100U, /*!< PWMA submodule 0 read request on capture FIFO marker */
    kDmaRequestMux0PWMA1CP = 11|0x100U, /*!< PWMA submodule 1 read request on capture FIFO marker */
    kDmaRequestMux0PWMA2CP = 12|0x100U, /*!< PWMA submodule 2 read request on capture FIFO marker */
    kDmaRequestMux0PWMA3CP = 13|0x100U, /*!< PWMA submodule 3 read request on capture FIFO marker */
    kDmaRequestMux0CAN0Rx = 14|0x100U, /*!< CAN0 reach receiever mailbox level */
    kDmaRequestMux0CAN1Rx = 15|0x100U, /*!< CAN1 reach receiever mailbox level */
    kDmaRequestMux0SPI0Rx = 16|0x100U, /*!< SPI receive complete */
    kDmaRequestMux0SPI0Tx = 17|0x100U, /*!< SPI transmit complete */
    kDmaRequestMux0XBARAOut0 = 18|0x100U, /*!< XBARA output 0 */
    kDmaRequestMux0XBARAOut1 = 19|0x100U, /*!< XBARA output 1 */
    kDmaRequestMux0XBARAOut2 = 20|0x100U, /*!< XBARA output 2 */
    kDmaRequestMux0XBARAOut3 = 21|0x100U, /*!< XBARA output 3 */
    kDmaRequestMux0I2C0 = 22|0x100U, /*!< I2C transmission complete */
    kDmaRequestMux0Reserved23 = 23|0x100U, /*!< Reserved23 */
    kDmaRequestMux0FTM0Channel0 = 24|0x100U, /*!< FTM0 channel 0 event  (CMP or CAP) */
    kDmaRequestMux0FTM0Channel1 = 25|0x100U, /*!< FTM0 channel 1 event  (CMP or CAP) */
    kDmaRequestMux0FTM0Channel2 = 26|0x100U, /*!< FTM0 channel 2 event  (CMP or CAP) */
    kDmaRequestMux0FTM0Channel3 = 27|0x100U, /*!< FTM0 channel 3 event  (CMP or CAP) */
    kDmaRequestMux0FTM0Channel4 = 28|0x100U, /*!< FTM0 channel 4 event  (CMP or CAP) */
    kDmaRequestMux0FTM0Channel5 = 29|0x100U, /*!< FTM0 channel 5 event  (CMP or CAP) */
    kDmaRequestMux0FTM0Channel6 = 30|0x100U, /*!< FTM0 channel 6 event  (CMP or CAP) */
    kDmaRequestMux0FTM0Channel7 = 31|0x100U, /*!< FTM0 channel 7 event  (CMP or CAP) */
    kDmaRequestMux0FTM1Channel0 = 32|0x100U, /*!< FTM1 channel 0 event  (CMP or CAP) */
    kDmaRequestMux0FTM1Channel1 = 33|0x100U, /*!< FTM1 channel 1 event  (CMP or CAP) */
    kDmaRequestMux0CMP0 = 34|0x100U, /*!< CMP0 output */
    kDmaRequestMux0Reserved35 = 35|0x100U, /*!< Reserved35 */
    kDmaRequestMux0FTM3Channel0 = 36|0x100U, /*!< FTM3 channel 0 event  (CMP or CAP) */
    kDmaRequestMux0FTM3Channel1 = 37|0x100U, /*!< FTM3 channel 1 event  (CMP or CAP) */
    kDmaRequestMux0FTM3Channel2 = 38|0x100U, /*!< FTM3 channel 2 event  (CMP or CAP) */
    kDmaRequestMux0FTM3Channel3 = 39|0x100U, /*!< FTM3 channel 3 event  (CMP or CAP) */
    kDmaRequestMux0ADCA = 40|0x100U, /*!< ADC converter A end of scan */
    kDmaRequestMux0ADCB = 41|0x100U, /*!< ADC converter B end of scan */
    kDmaRequestMux0CMP1 = 42|0x100U, /*!< CMP1 output */
    kDmaRequestMux0CMP2 = 43|0x100U, /*!< CMP2 output */
    kDmaRequestMux0CMP3 = 44|0x100U, /*!< CMP3 output */
    kDmaRequestMux0Reserved45 = 45|0x100U, /*!< Reserved45 */
    kDmaRequestMux0Reserved46 = 46|0x100U, /*!< Reserved46 */
    kDmaRequestMux0PDB0 = 47|0x100U, /*!< PDB0 channel 0 output trigger */
    kDmaRequestMux0PDB1 = 48|0x100U, /*!< PDB1 channel 0 output trigger */
    kDmaRequestMux0PortA = 49|0x100U, /*!< PORTA rising, falling or both edges */
    kDmaRequestMux0PortB = 50|0x100U, /*!< PORTB rising, falling or both edges */
    kDmaRequestMux0PortC = 51|0x100U, /*!< PORTC rising, falling or both edges */
    kDmaRequestMux0PortD = 52|0x100U, /*!< PORTD rising, falling or both edges */
    kDmaRequestMux0PortE = 53|0x100U, /*!< PORTE rising, falling or both edges */
    kDmaRequestMux0FTM3Channel4 = 54|0x100U, /*!< FTM3 channel 4 event  (CMP or CAP) */
    kDmaRequestMux0FTM3Channel5 = 55|0x100U, /*!< FTM3 channel 5 event  (CMP or CAP) */
    kDmaRequestMux0FTM3Channel6 = 56|0x100U, /*!< FTM3 channel 6 event  (CMP or CAP) */
    kDmaRequestMux0FTM3Channel7 = 57|0x100U, /*!< FTM3 channel 7 event  (CMP or CAP) */
    kDmaRequestMux0AlwaysOn58 = 58|0x100U, /*!< Slot 58 is always enabled */
    kDmaRequestMux0AlwaysOn59 = 59|0x100U, /*!< Slot 59 is always enabled */
    kDmaRequestMux0AlwaysOn60 = 60|0x100U, /*!< Slot 60 is always enabled */
    kDmaRequestMux0AlwaysOn61 = 61|0x100U, /*!< Slot 61 is always enabled */
    kDmaRequestMux0AlwaysOn62 = 62|0x100U, /*!< Slot 62 is always enabled */
    kDmaRequestMux0AlwaysOn63 = 63|0x100U, /*!< Slot 63 is always enabled */
#elif defined(CPU_MKV46F128VLH15) || defined(CPU_MKV46F256VLH15)
    kDmaRequestMux0Disable = 0|0x100U, /*!< DMA requests are disabled. */
    kDmaRequestMux0Reserved1 = 1|0x100U, /*!< Reserved1 */
    kDmaRequestMux0UART0Rx = 2|0x100U, /*!< UART0 receive complete */
    kDmaRequestMux0UART0Tx = 3|0x100U, /*!< UART0 transmit complete */
    kDmaRequestMux0UART1Rx = 4|0x100U, /*!< UART1 receive complete */
    kDmaRequestMux0UART1Tx = 5|0x100U, /*!< UART1 transmit complete */
    kDmaRequestMux0PWMA0WR = 6|0x100U, /*!< PWMA submodule 0 write request on beginning of reload cycle */
    kDmaRequestMux0PWMA1WR = 7|0x100U, /*!< PWMA submodule 1 write request on beginning of reload cycle */
    kDmaRequestMux0PWMA2WR = 8|0x100U, /*!< PWMA submodule 2 write request on beginning of reload cycle */
    kDmaRequestMux0PWMA3WR = 9|0x100U, /*!< PWMA submodule 3 write request on beginning of reload cycle */
    kDmaRequestMux0PWMA0CP = 10|0x100U, /*!< PWMA submodule 0 read request on capture FIFO marker */
    kDmaRequestMux0PWMA1CP = 11|0x100U, /*!< PWMA submodule 1 read request on capture FIFO marker */
    kDmaRequestMux0PWMA2CP = 12|0x100U, /*!< PWMA submodule 2 read request on capture FIFO marker */
    kDmaRequestMux0PWMA3CP = 13|0x100U, /*!< PWMA submodule 3 read request on capture FIFO marker */
    kDmaRequestMux0CAN0Rx = 14|0x100U, /*!< CAN0 reach receiever mailbox level */
    kDmaRequestMux0CAN1Rx = 15|0x100U, /*!< CAN1 reach receiever mailbox level */
    kDmaRequestMux0SPI0Rx = 16|0x100U, /*!< SPI receive complete */
    kDmaRequestMux0SPI0Tx = 17|0x100U, /*!< SPI transmit complete */
    kDmaRequestMux0XBARAOut0 = 18|0x100U, /*!< XBARA output 0 */
    kDmaRequestMux0XBARAOut1 = 19|0x100U, /*!< XBARA output 1 */
    kDmaRequestMux0XBARAOut2 = 20|0x100U, /*!< XBARA output 2 */
    kDmaRequestMux0XBARAOut3 = 21|0x100U, /*!< XBARA output 3 */
    kDmaRequestMux0I2C0 = 22|0x100U, /*!< I2C transmission complete */
    kDmaRequestMux0Reserved23 = 23|0x100U, /*!< Reserved23 */
    kDmaRequestMux0FTM0Channel0 = 24|0x100U, /*!< FTM0 channel 0 event  (CMP or CAP) */
    kDmaRequestMux0FTM0Channel1 = 25|0x100U, /*!< FTM0 channel 1 event  (CMP or CAP) */
    kDmaRequestMux0FTM0Channel2 = 26|0x100U, /*!< FTM0 channel 2 event  (CMP or CAP) */
    kDmaRequestMux0FTM0Channel3 = 27|0x100U, /*!< FTM0 channel 3 event  (CMP or CAP) */
    kDmaRequestMux0FTM0Channel4 = 28|0x100U, /*!< FTM0 channel 4 event  (CMP or CAP) */
    kDmaRequestMux0FTM0Channel5 = 29|0x100U, /*!< FTM0 channel 5 event  (CMP or CAP) */
    kDmaRequestMux0FTM0Channel6 = 30|0x100U, /*!< FTM0 channel 6 event  (CMP or CAP) */
    kDmaRequestMux0FTM0Channel7 = 31|0x100U, /*!< FTM0 channel 7 event  (CMP or CAP) */
    kDmaRequestMux0FTM1Channel0 = 32|0x100U, /*!< FTM1 channel 0 event  (CMP or CAP) */
    kDmaRequestMux0FTM1Channel1 = 33|0x100U, /*!< FTM1 channel 1 event  (CMP or CAP) */
    kDmaRequestMux0CMP0 = 34|0x100U, /*!< CMP0 output */
    kDmaRequestMux0Reserved35 = 35|0x100U, /*!< Reserved35 */
    kDmaRequestMux0Reserved36 = 36|0x100U, /*!< Reserved36 */
    kDmaRequestMux0Reserved37 = 37|0x100U, /*!< Reserved37 */
    kDmaRequestMux0Reserved38 = 38|0x100U, /*!< Reserved38 */
    kDmaRequestMux0Reserved39 = 39|0x100U, /*!< Reserved39 */
    kDmaRequestMux0ADCA = 40|0x100U, /*!< ADC converter A end of scan */
    kDmaRequestMux0ADCB = 41|0x100U, /*!< ADC converter B end of scan */
    kDmaRequestMux0CMP1 = 42|0x100U, /*!< CMP1 output */
    kDmaRequestMux0CMP2 = 43|0x100U, /*!< CMP2 output */
    kDmaRequestMux0CMP3 = 44|0x100U, /*!< CMP3 output */
    kDmaRequestMux0DAC0 = 45|0x100U, /*!< DAC buffer pointer reaches upper or lower limit */
    kDmaRequestMux0Reserved46 = 46|0x100U, /*!< Reserved46 */
    kDmaRequestMux0PDB0 = 47|0x100U, /*!< PDB0 channel 0 output trigger */
    kDmaRequestMux0PDB1 = 48|0x100U, /*!< PDB1 channel 0 output trigger */
    kDmaRequestMux0PortA = 49|0x100U, /*!< PORTA rising, falling or both edges */
    kDmaRequestMux0PortB = 50|0x100U, /*!< PORTB rising, falling or both edges */
    kDmaRequestMux0PortC = 51|0x100U, /*!< PORTC rising, falling or both edges */
    kDmaRequestMux0PortD = 52|0x100U, /*!< PORTD rising, falling or both edges */
    kDmaRequestMux0PortE = 53|0x100U, /*!< PORTE rising, falling or both edges */
    kDmaRequestMux0Reserved54 = 54|0x100U, /*!< Reserved54 */
    kDmaRequestMux0Reserved55 = 55|0x100U, /*!< Reserved55 */
    kDmaRequestMux0Reserved56 = 56|0x100U, /*!< Reserved56 */
    kDmaRequestMux0Reserved57 = 57|0x100U, /*!< Reserved57 */
    kDmaRequestMux0AlwaysOn58 = 58|0x100U, /*!< Slot 58 is always enabled */
    kDmaRequestMux0AlwaysOn59 = 59|0x100U, /*!< Slot 59 is always enabled */
    kDmaRequestMux0AlwaysOn60 = 60|0x100U, /*!< Slot 60 is always enabled */
    kDmaRequestMux0AlwaysOn61 = 61|0x100U, /*!< Slot 61 is always enabled */
    kDmaRequestMux0AlwaysOn62 = 62|0x100U, /*!< Slot 62 is always enabled */
    kDmaRequestMux0AlwaysOn63 = 63|0x100U, /*!< Slot 63 is always enabled */
#elif defined(CPU_MKV46F128VLL15) || defined(CPU_MKV46F256VLL15)
    kDmaRequestMux0Disable = 0|0x100U, /*!< DMA requests are disabled. */
    kDmaRequestMux0Reserved1 = 1|0x100U, /*!< Reserved1 */
    kDmaRequestMux0UART0Rx = 2|0x100U, /*!< UART0 receive complete */
    kDmaRequestMux0UART0Tx = 3|0x100U, /*!< UART0 transmit complete */
    kDmaRequestMux0UART1Rx = 4|0x100U, /*!< UART1 receive complete */
    kDmaRequestMux0UART1Tx = 5|0x100U, /*!< UART1 transmit complete */
    kDmaRequestMux0PWMA0WR = 6|0x100U, /*!< PWMA submodule 0 write request on beginning of reload cycle */
    kDmaRequestMux0PWMA1WR = 7|0x100U, /*!< PWMA submodule 1 write request on beginning of reload cycle */
    kDmaRequestMux0PWMA2WR = 8|0x100U, /*!< PWMA submodule 2 write request on beginning of reload cycle */
    kDmaRequestMux0PWMA3WR = 9|0x100U, /*!< PWMA submodule 3 write request on beginning of reload cycle */
    kDmaRequestMux0PWMA0CP = 10|0x100U, /*!< PWMA submodule 0 read request on capture FIFO marker */
    kDmaRequestMux0PWMA1CP = 11|0x100U, /*!< PWMA submodule 1 read request on capture FIFO marker */
    kDmaRequestMux0PWMA2CP = 12|0x100U, /*!< PWMA submodule 2 read request on capture FIFO marker */
    kDmaRequestMux0PWMA3CP = 13|0x100U, /*!< PWMA submodule 3 read request on capture FIFO marker */
    kDmaRequestMux0CAN0Rx = 14|0x100U, /*!< CAN0 reach receiever mailbox level */
    kDmaRequestMux0CAN1Rx = 15|0x100U, /*!< CAN1 reach receiever mailbox level */
    kDmaRequestMux0SPI0Rx = 16|0x100U, /*!< SPI receive complete */
    kDmaRequestMux0SPI0Tx = 17|0x100U, /*!< SPI transmit complete */
    kDmaRequestMux0XBARAOut0 = 18|0x100U, /*!< XBARA output 0 */
