m-okada/QV08/emu/ARM/kinetis_workspace/t03/SDK/platform/drivers/inc/fsl_edma_request.h
    kDmaRequestMux0XBARAOut1 = 19|0x100U, /*!< XBARA output 1 */
    kDmaRequestMux0XBARAOut2 = 20|0x100U, /*!< XBARA output 2 */
    kDmaRequestMux0XBARAOut3 = 21|0x100U, /*!< XBARA output 3 */
    kDmaRequestMux0I2C0 = 22|0x100U, /*!< I2C transmission complete */
    kDmaRequestMux0Reserved23 = 23|0x100U, /*!< Reserved23 */
    kDmaRequestMux0FTM0Channel0 = 24|0x100U, /*!< FTM0 channel 0 event  (CMP or CAP) */
    kDmaRequestMux0FTM0Channel1 = 25|0x100U, /*!< FTM0 channel 1 event  (CMP or CAP) */
    kDmaRequestMux0FTM0Channel2 = 26|0x100U, /*!< FTM0 channel 2 event  (CMP or CAP) */
    kDmaRequestMux0FTM0Channel3 = 27|0x100U, /*!< FTM0 channel 3 event  (CMP or CAP) */
    kDmaRequestMux0FTM0Channel4 = 28|0x100U, /*!< FTM0 channel 4 event  (CMP or CAP) */
    kDmaRequestMux0FTM0Channel5 = 29|0x100U, /*!< FTM0 channel 5 event  (CMP or CAP) */
    kDmaRequestMux0FTM0Channel6 = 30|0x100U, /*!< FTM0 channel 6 event  (CMP or CAP) */
    kDmaRequestMux0FTM0Channel7 = 31|0x100U, /*!< FTM0 channel 7 event  (CMP or CAP) */
    kDmaRequestMux0FTM1Channel0 = 32|0x100U, /*!< FTM1 channel 0 event  (CMP or CAP) */
    kDmaRequestMux0FTM1Channel1 = 33|0x100U, /*!< FTM1 channel 1 event  (CMP or CAP) */
    kDmaRequestMux0CMP0 = 34|0x100U, /*!< CMP0 output */
    kDmaRequestMux0Reserved35 = 35|0x100U, /*!< Reserved35 */
    kDmaRequestMux0FTM3Channel0 = 36|0x100U, /*!< FTM3 channel 0 event  (CMP or CAP) */
    kDmaRequestMux0FTM3Channel1 = 37|0x100U, /*!< FTM3 channel 1 event  (CMP or CAP) */
    kDmaRequestMux0FTM3Channel2 = 38|0x100U, /*!< FTM3 channel 2 event  (CMP or CAP) */
    kDmaRequestMux0FTM3Channel3 = 39|0x100U, /*!< FTM3 channel 3 event  (CMP or CAP) */
    kDmaRequestMux0ADCA = 40|0x100U, /*!< ADC converter A end of scan */
    kDmaRequestMux0ADCB = 41|0x100U, /*!< ADC converter B end of scan */
    kDmaRequestMux0CMP1 = 42|0x100U, /*!< CMP1 output */
    kDmaRequestMux0CMP2 = 43|0x100U, /*!< CMP2 output */
    kDmaRequestMux0CMP3 = 44|0x100U, /*!< CMP3 output */
    kDmaRequestMux0DAC0 = 45|0x100U, /*!< DAC buffer pointer reaches upper or lower limit */
    kDmaRequestMux0Reserved46 = 46|0x100U, /*!< Reserved46 */
    kDmaRequestMux0PDB0 = 47|0x100U, /*!< PDB0 channel 0 output trigger */
    kDmaRequestMux0PDB1 = 48|0x100U, /*!< PDB1 channel 0 output trigger */
    kDmaRequestMux0PortA = 49|0x100U, /*!< PORTA rising, falling or both edges */
    kDmaRequestMux0PortB = 50|0x100U, /*!< PORTB rising, falling or both edges */
    kDmaRequestMux0PortC = 51|0x100U, /*!< PORTC rising, falling or both edges */
    kDmaRequestMux0PortD = 52|0x100U, /*!< PORTD rising, falling or both edges */
    kDmaRequestMux0PortE = 53|0x100U, /*!< PORTE rising, falling or both edges */
    kDmaRequestMux0FTM3Channel4 = 54|0x100U, /*!< FTM3 channel 4 event  (CMP or CAP) */
    kDmaRequestMux0FTM3Channel5 = 55|0x100U, /*!< FTM3 channel 5 event  (CMP or CAP) */
    kDmaRequestMux0FTM3Channel6 = 56|0x100U, /*!< FTM3 channel 6 event  (CMP or CAP) */
    kDmaRequestMux0FTM3Channel7 = 57|0x100U, /*!< FTM3 channel 7 event  (CMP or CAP) */
    kDmaRequestMux0AlwaysOn58 = 58|0x100U, /*!< Slot 58 is always enabled */
    kDmaRequestMux0AlwaysOn59 = 59|0x100U, /*!< Slot 59 is always enabled */
    kDmaRequestMux0AlwaysOn60 = 60|0x100U, /*!< Slot 60 is always enabled */
    kDmaRequestMux0AlwaysOn61 = 61|0x100U, /*!< Slot 61 is always enabled */
    kDmaRequestMux0AlwaysOn62 = 62|0x100U, /*!< Slot 62 is always enabled */
    kDmaRequestMux0AlwaysOn63 = 63|0x100U, /*!< Slot 63 is always enabled */
#elif defined(CPU_MKV56F1M0VLL22) || defined(CPU_MKV56F512VLL22) || defined(CPU_MKV56F1M0VLQ22) || defined(CPU_MKV56F512VLQ22) || \
    defined(CPU_MKV56F1M0VMD22) || defined(CPU_MKV56F512VMD22)
    kDmaRequestMux0Disable = 0|0x100U, /*!< DMAMUX TriggerDisabled. */
    kDmaRequestMux0Reserved1 = 1|0x100U, /*!< Reserved1 */
    kDmaRequestMux0UART0Rx = 2|0x100U, /*!< UART0 Receive. */
    kDmaRequestMux0UART0Tx = 3|0x100U, /*!< UART0 Transmit. */
    kDmaRequestMux0UART1Rx = 4|0x100U, /*!< UART1 Receive. */
    kDmaRequestMux0UART1Tx = 5|0x100U, /*!< UART1 Transmit. */
    kDmaRequestMux0PWM0WR0 = 6|0x100U, /*!< PWM0 Write Request 0. */
    kDmaRequestMux0PWM0WR1 = 7|0x100U, /*!< PWM0 Write Request 1. */
    kDmaRequestMux0PWM0WR2 = 8|0x100U, /*!< PWM0 Write Request 2. */
    kDmaRequestMux0PWM0WR3 = 9|0x100U, /*!< PWM0 Write Request 3. */
    kDmaRequestMux0PWM0CP0 = 10|0x100U, /*!< PWM0 Capture 0. */
    kDmaRequestMux0PWM0CP1 = 11|0x100U, /*!< PWM0 Capture 1. */
    kDmaRequestMux0PWM0CP2 = 12|0x100U, /*!< PWM0 Capture 2. */
    kDmaRequestMux0PWM0CP3 = 13|0x100U, /*!< PWM0 Capture 3. */
    kDmaRequestMux0CAN0 = 14|0x100U, /*!< CAN0. */
    kDmaRequestMux0CAN1 = 15|0x100U, /*!< CAN1. */
    kDmaRequestMux0SPI0Rx = 16|0x100U, /*!< SPI0 Receive. */
    kDmaRequestMux0SPI0Tx = 17|0x100U, /*!< SPI0 Transmit. */
    kDmaRequestMux0XBARAOUT0 = 18|0x100U, /*!< XBARA Output 0. */
    kDmaRequestMux0XBARAOUT1 = 19|0x100U, /*!< XBARA Output 1. */
    kDmaRequestMux0XBARAOUT2 = 20|0x100U, /*!< XBARA Output 2. */
    kDmaRequestMux0XBARAOUT3 = 21|0x100U, /*!< XBARA Output 3. */
    kDmaRequestMux0I2C0 = 22|0x100U, /*!< I2C0. */
    kDmaRequestMux0Reserved23 = 23|0x100U, /*!< Reserved23 */
    kDmaRequestMux0FTM0Channel0 = 24|0x100U, /*!< FTM0 C0V. */
    kDmaRequestMux0FTM0Channel1 = 25|0x100U, /*!< FTM0 C1V. */
    kDmaRequestMux0FTM0Channel2 = 26|0x100U, /*!< FTM0 C2V. */
    kDmaRequestMux0FTM0Channel3 = 27|0x100U, /*!< FTM0 C3V. */
    kDmaRequestMux0FTM0Channel4 = 28|0x100U, /*!< FTM0 C4V. */
    kDmaRequestMux0FTM0Channel5 = 29|0x100U, /*!< FTM0 C5V. */
    kDmaRequestMux0FTM0Channel6 = 30|0x100U, /*!< FTM0 C6V. */
    kDmaRequestMux0FTM0Channel7 = 31|0x100U, /*!< FTM0 C7V. */
    kDmaRequestMux0FTM1Channel0 = 32|0x100U, /*!< FTM1 C0V. */
    kDmaRequestMux0FTM1Channel1 = 33|0x100U, /*!< FTM1 C1V. */
    kDmaRequestMux0CMP3 = 34|0x100U, /*!< CMP3. */
    kDmaRequestMux0Reserved35 = 35|0x100U, /*!< Reserved35 */
    kDmaRequestMux0FTM3Channel0 = 36|0x100U, /*!< FTM3 C0V. */
    kDmaRequestMux0FTM3Channel1 = 37|0x100U, /*!< FTM3 C1V. */
    kDmaRequestMux0FTM3Channel2 = 38|0x100U, /*!< FTM3 C2V. */
    kDmaRequestMux0FTM3Channel3 = 39|0x100U, /*!< FTM3 C3V. */
    kDmaRequestMux0HSADC0A = 40|0x100U, /*!< HSADC0. */
    kDmaRequestMux0HSADC0B = 41|0x100U, /*!< HSADC0. */
    kDmaRequestMux0CMP0 = 42|0x100U, /*!< CMP0. */
    kDmaRequestMux0CMP1 = 43|0x100U, /*!< CMP1. */
    kDmaRequestMux0CMP2 = 44|0x100U, /*!< CMP2. */
    kDmaRequestMux0DAC0 = 45|0x100U, /*!< DAC0. */
    kDmaRequestMux0Reserved46 = 46|0x100U, /*!< Reserved46 */
    kDmaRequestMux0PDB1 = 47|0x100U, /*!< PDB1. */
    kDmaRequestMux0PDB0 = 48|0x100U, /*!< PDB0. */
    kDmaRequestMux0PortA = 49|0x100U, /*!< PTA. */
    kDmaRequestMux0PortB = 50|0x100U, /*!< PTB. */
    kDmaRequestMux0PortC = 51|0x100U, /*!< PTC. */
    kDmaRequestMux0PortD = 52|0x100U, /*!< PTD. */
    kDmaRequestMux0PortE = 53|0x100U, /*!< PTE. */
    kDmaRequestMux0FTM3Channel4 = 54|0x100U, /*!< FTM3 C4V. */
    kDmaRequestMux0FTM3Channel5 = 55|0x100U, /*!< FTM3 C5V. */
    kDmaRequestMux0FTM3Channel6 = 56|0x100U, /*!< FTM3 C6V. */
    kDmaRequestMux0FTM3Channel7 = 57|0x100U, /*!< FTM3 C7V. */
    kDmaRequestMux0Reserved58 = 58|0x100U, /*!< Reserved58 */
    kDmaRequestMux0Reserved59 = 59|0x100U, /*!< Reserved59 */
    kDmaRequestMux0AlwaysOn60 = 60|0x100U, /*!< DMAMUX Always Enabled slot. */
    kDmaRequestMux0AlwaysOn61 = 61|0x100U, /*!< DMAMUX Always Enabled slot. */
    kDmaRequestMux0AlwaysOn62 = 62|0x100U, /*!< DMAMUX Always Enabled slot. */
    kDmaRequestMux0AlwaysOn63 = 63|0x100U, /*!< DMAMUX Always Enabled slot. */
    kDmaRequestMux0Group1Disable = 0|0x200U, /*!< DMAMUX TriggerDisabled. */
    kDmaRequestMux0Group1Reserved1 = 1|0x200U, /*!< Reserved1 */
    kDmaRequestMux0Group1UART2Rx = 2|0x200U, /*!< UART2 Receive. */
    kDmaRequestMux0Group1UART2Tx = 3|0x200U, /*!< UART2 Transmit. */
    kDmaRequestMux0Group1UART3Rx = 4|0x200U, /*!< UART3 Receive. */
    kDmaRequestMux0Group1UART3Tx = 5|0x200U, /*!< UART3 Transmit. */
    kDmaRequestMux0Group1PWM1WR0 = 6|0x200U, /*!< PWM1 Write Request 0. */
    kDmaRequestMux0Group1PWM1WR1 = 7|0x200U, /*!< PWM1 Write Request 1. */
    kDmaRequestMux0Group1PWM1WR2 = 8|0x200U, /*!< PWM1 Write Request 2. */
    kDmaRequestMux0Group1PWM1WR3 = 9|0x200U, /*!< PWM1 Write Request 3. */
    kDmaRequestMux0Group1PWM1CP0 = 10|0x200U, /*!< PWM1 Capture 0. */
    kDmaRequestMux0Group1PWM1CP1 = 11|0x200U, /*!< PWM1 Capture 1. */
    kDmaRequestMux0Group1PWM1CP2 = 12|0x200U, /*!< PWM1 Capture 2. */
    kDmaRequestMux0Group1PWM1CP3 = 13|0x200U, /*!< PWM1 Capture 3. */
    kDmaRequestMux0Group1Reserved14 = 14|0x200U, /*!< Reserved14 */
    kDmaRequestMux0Group1Reserved15 = 15|0x200U, /*!< Reserved15 */
    kDmaRequestMux0Group1SPI1Rx = 16|0x200U, /*!< SPI1 Receive. */
    kDmaRequestMux0Group1SPI1Tx = 17|0x200U, /*!< SPI1 Transmit. */
    kDmaRequestMux0Group1Reserved18 = 18|0x200U, /*!< Reserved18 */
    kDmaRequestMux0Group1Reserved19 = 19|0x200U, /*!< Reserved19 */
    kDmaRequestMux0Group1Reserved20 = 20|0x200U, /*!< Reserved20 */
    kDmaRequestMux0Group1Reserved21 = 21|0x200U, /*!< Reserved21 */
    kDmaRequestMux0Group1I2C1 = 22|0x200U, /*!< I2C1. */
    kDmaRequestMux0Group1Reserved23 = 23|0x200U, /*!< Reserved23 */
    kDmaRequestMux0Group1Reserved24 = 24|0x200U, /*!< Reserved24 */
    kDmaRequestMux0Group1Reserved25 = 25|0x200U, /*!< Reserved25 */
    kDmaRequestMux0Group1Reserved26 = 26|0x200U, /*!< Reserved26 */
    kDmaRequestMux0Group1Reserved27 = 27|0x200U, /*!< Reserved27 */
    kDmaRequestMux0Group1Reserved28 = 28|0x200U, /*!< Reserved28 */
    kDmaRequestMux0Group1Reserved29 = 29|0x200U, /*!< Reserved29 */
    kDmaRequestMux0Group1Reserved30 = 30|0x200U, /*!< Reserved30 */
    kDmaRequestMux0Group1Reserved31 = 31|0x200U, /*!< Reserved31 */
    kDmaRequestMux0Group1FTM2Channel0 = 32|0x200U, /*!< FTM2 C0V. */
    kDmaRequestMux0Group1FTM2Channel1 = 33|0x200U, /*!< FTM2 C1V. */
    kDmaRequestMux0Group1SPI2Rx = 34|0x200U, /*!< SPI2 Receive. */
    kDmaRequestMux0Group1SPI2Tx = 35|0x200U, /*!< SPI2 Transmit. */
    kDmaRequestMux0Group1Reserved36 = 36|0x200U, /*!< Reserved36 */
    kDmaRequestMux0Group1Reserved37 = 37|0x200U, /*!< Reserved37 */
    kDmaRequestMux0Group1Reserved38 = 38|0x200U, /*!< Reserved38 */
    kDmaRequestMux0Group1Reserved39 = 39|0x200U, /*!< Reserved39 */
    kDmaRequestMux0Group1HSADC1A = 40|0x200U, /*!< HSADC1. */
    kDmaRequestMux0Group1HSADC1B = 41|0x200U, /*!< HSADC1. */
    kDmaRequestMux0Group1Reserved42 = 42|0x200U, /*!< Reserved42 */
    kDmaRequestMux0Group1Reserved43 = 43|0x200U, /*!< Reserved43 */
    kDmaRequestMux0Group1Reserved44 = 44|0x200U, /*!< Reserved44 */
    kDmaRequestMux0Group1ADC0 = 45|0x200U, /*!< ADC0. */
    kDmaRequestMux0Group1Reserved46 = 46|0x200U, /*!< Reserved46 */
    kDmaRequestMux0Group1Reserved47 = 47|0x200U, /*!< Reserved47 */
    kDmaRequestMux0Group1Reserved48 = 48|0x200U, /*!< Reserved48 */
    kDmaRequestMux0Group1Reserved49 = 49|0x200U, /*!< Reserved49 */
    kDmaRequestMux0Group1Reserved50 = 50|0x200U, /*!< Reserved50 */
    kDmaRequestMux0Group1Reserved51 = 51|0x200U, /*!< Reserved51 */
    kDmaRequestMux0Group1Reserved52 = 52|0x200U, /*!< Reserved52 */
    kDmaRequestMux0Group1Reserved53 = 53|0x200U, /*!< Reserved53 */
    kDmaRequestMux0Group1UART4Rx = 54|0x200U, /*!< UART4 Receive. */
    kDmaRequestMux0Group1UART4Tx = 55|0x200U, /*!< UART4 Transmit. */
    kDmaRequestMux0Group1UART5Rx = 56|0x200U, /*!< UART5 Receive. */
    kDmaRequestMux0Group1UART5Tx = 57|0x200U, /*!< UART5 Transmit. */
    kDmaRequestMux0Group1Reserved58 = 58|0x200U, /*!< Reserved58 */
    kDmaRequestMux0Group1Reserved59 = 59|0x200U, /*!< Reserved59 */
    kDmaRequestMux0Group1AlwaysOn60 = 60|0x200U, /*!< DMAMUX Always Enabled slot. */
    kDmaRequestMux0Group1AlwaysOn61 = 61|0x200U, /*!< DMAMUX Always Enabled slot. */
    kDmaRequestMux0Group1AlwaysOn62 = 62|0x200U, /*!< DMAMUX Always Enabled slot. */
    kDmaRequestMux0Group1AlwaysOn63 = 63|0x200U, /*!< DMAMUX Always Enabled slot. */
#elif defined(CPU_MKV58F1M0VLL22) || defined(CPU_MKV58F512VLL22) || defined(CPU_MKV58F1M0VLQ22) || defined(CPU_MKV58F512VLQ22) || \
    defined(CPU_MKV58F1M0VMD22) || defined(CPU_MKV58F512VMD22)
    kDmaRequestMux0Disable = 0|0x100U, /*!< DMAMUX TriggerDisabled. */
    kDmaRequestMux0Reserved1 = 1|0x100U, /*!< Reserved1 */
    kDmaRequestMux0UART0Rx = 2|0x100U, /*!< UART0 Receive. */
    kDmaRequestMux0UART0Tx = 3|0x100U, /*!< UART0 Transmit. */
    kDmaRequestMux0UART1Rx = 4|0x100U, /*!< UART1 Receive. */
    kDmaRequestMux0UART1Tx = 5|0x100U, /*!< UART1 Transmit. */
    kDmaRequestMux0PWM0WR0 = 6|0x100U, /*!< PWM0 Write Request 0. */
    kDmaRequestMux0PWM0WR1 = 7|0x100U, /*!< PWM0 Write Request 1. */
    kDmaRequestMux0PWM0WR2 = 8|0x100U, /*!< PWM0 Write Request 2. */
    kDmaRequestMux0PWM0WR3 = 9|0x100U, /*!< PWM0 Write Request 3. */
    kDmaRequestMux0PWM0CP0 = 10|0x100U, /*!< PWM0 Capture 0. */
    kDmaRequestMux0PWM0CP1 = 11|0x100U, /*!< PWM0 Capture 1. */
    kDmaRequestMux0PWM0CP2 = 12|0x100U, /*!< PWM0 Capture 2. */
    kDmaRequestMux0PWM0CP3 = 13|0x100U, /*!< PWM0 Capture 3. */
    kDmaRequestMux0CAN0 = 14|0x100U, /*!< CAN0. */
    kDmaRequestMux0CAN1 = 15|0x100U, /*!< CAN1. */
    kDmaRequestMux0SPI0Rx = 16|0x100U, /*!< SPI0 Receive. */
    kDmaRequestMux0SPI0Tx = 17|0x100U, /*!< SPI0 Transmit. */
    kDmaRequestMux0XBARAOUT0 = 18|0x100U, /*!< XBARA Output 0. */
    kDmaRequestMux0XBARAOUT1 = 19|0x100U, /*!< XBARA Output 1. */
    kDmaRequestMux0XBARAOUT2 = 20|0x100U, /*!< XBARA Output 2. */
    kDmaRequestMux0XBARAOUT3 = 21|0x100U, /*!< XBARA Output 3. */
    kDmaRequestMux0I2C0 = 22|0x100U, /*!< I2C0. */
    kDmaRequestMux0Reserved23 = 23|0x100U, /*!< Reserved23 */
    kDmaRequestMux0FTM0Channel0 = 24|0x100U, /*!< FTM0 C0V. */
    kDmaRequestMux0FTM0Channel1 = 25|0x100U, /*!< FTM0 C1V. */
    kDmaRequestMux0FTM0Channel2 = 26|0x100U, /*!< FTM0 C2V. */
    kDmaRequestMux0FTM0Channel3 = 27|0x100U, /*!< FTM0 C3V. */
    kDmaRequestMux0FTM0Channel4 = 28|0x100U, /*!< FTM0 C4V. */
    kDmaRequestMux0FTM0Channel5 = 29|0x100U, /*!< FTM0 C5V. */
    kDmaRequestMux0FTM0Channel6 = 30|0x100U, /*!< FTM0 C6V. */
    kDmaRequestMux0FTM0Channel7 = 31|0x100U, /*!< FTM0 C7V. */
    kDmaRequestMux0FTM1Channel0 = 32|0x100U, /*!< FTM1 C0V. */
    kDmaRequestMux0FTM1Channel1 = 33|0x100U, /*!< FTM1 C1V. */
    kDmaRequestMux0CMP3 = 34|0x100U, /*!< CMP3. */
    kDmaRequestMux0Reserved35 = 35|0x100U, /*!< Reserved35 */
    kDmaRequestMux0FTM3Channel0 = 36|0x100U, /*!< FTM3 C0V. */
    kDmaRequestMux0FTM3Channel1 = 37|0x100U, /*!< FTM3 C1V. */
    kDmaRequestMux0FTM3Channel2 = 38|0x100U, /*!< FTM3 C2V. */
    kDmaRequestMux0FTM3Channel3 = 39|0x100U, /*!< FTM3 C3V. */
    kDmaRequestMux0HSADC0A = 40|0x100U, /*!< HSADC0. */
    kDmaRequestMux0HSADC0B = 41|0x100U, /*!< HSADC0. */
    kDmaRequestMux0CMP0 = 42|0x100U, /*!< CMP0. */
    kDmaRequestMux0CMP1 = 43|0x100U, /*!< CMP1. */
    kDmaRequestMux0CMP2 = 44|0x100U, /*!< CMP2. */
    kDmaRequestMux0DAC0 = 45|0x100U, /*!< DAC0. */
    kDmaRequestMux0Reserved46 = 46|0x100U, /*!< Reserved46 */
    kDmaRequestMux0PDB1 = 47|0x100U, /*!< PDB1. */
    kDmaRequestMux0PDB0 = 48|0x100U, /*!< PDB0. */
    kDmaRequestMux0PortA = 49|0x100U, /*!< PTA. */
    kDmaRequestMux0PortB = 50|0x100U, /*!< PTB. */
    kDmaRequestMux0PortC = 51|0x100U, /*!< PTC. */
    kDmaRequestMux0PortD = 52|0x100U, /*!< PTD. */
    kDmaRequestMux0PortE = 53|0x100U, /*!< PTE. */
    kDmaRequestMux0FTM3Channel4 = 54|0x100U, /*!< FTM3 C4V. */
    kDmaRequestMux0FTM3Channel5 = 55|0x100U, /*!< FTM3 C5V. */
    kDmaRequestMux0FTM3Channel6 = 56|0x100U, /*!< FTM3 C6V. */
    kDmaRequestMux0FTM3Channel7 = 57|0x100U, /*!< FTM3 C7V. */
    kDmaRequestMux0Reserved58 = 58|0x100U, /*!< Reserved58 */
    kDmaRequestMux0Reserved59 = 59|0x100U, /*!< Reserved59 */
    kDmaRequestMux0AlwaysOn60 = 60|0x100U, /*!< DMAMUX Always Enabled slot. */
    kDmaRequestMux0AlwaysOn61 = 61|0x100U, /*!< DMAMUX Always Enabled slot. */
    kDmaRequestMux0AlwaysOn62 = 62|0x100U, /*!< DMAMUX Always Enabled slot. */
    kDmaRequestMux0AlwaysOn63 = 63|0x100U, /*!< DMAMUX Always Enabled slot. */
    kDmaRequestMux0Group1Disable = 0|0x200U, /*!< DMAMUX TriggerDisabled. */
    kDmaRequestMux0Group1Reserved1 = 1|0x200U, /*!< Reserved1 */
    kDmaRequestMux0Group1UART2Rx = 2|0x200U, /*!< UART2 Receive. */
    kDmaRequestMux0Group1UART2Tx = 3|0x200U, /*!< UART2 Transmit. */
    kDmaRequestMux0Group1UART3Rx = 4|0x200U, /*!< UART3 Receive. */
    kDmaRequestMux0Group1UART3Tx = 5|0x200U, /*!< UART3 Transmit. */
    kDmaRequestMux0Group1PWM1WR0 = 6|0x200U, /*!< PWM1 Write Request 0. */
    kDmaRequestMux0Group1PWM1WR1 = 7|0x200U, /*!< PWM1 Write Request 1. */
    kDmaRequestMux0Group1PWM1WR2 = 8|0x200U, /*!< PWM1 Write Request 2. */
    kDmaRequestMux0Group1PWM1WR3 = 9|0x200U, /*!< PWM1 Write Request 3. */
    kDmaRequestMux0Group1PWM1CP0 = 10|0x200U, /*!< PWM1 Capture 0. */
    kDmaRequestMux0Group1PWM1CP1 = 11|0x200U, /*!< PWM1 Capture 1. */
    kDmaRequestMux0Group1PWM1CP2 = 12|0x200U, /*!< PWM1 Capture 2. */
    kDmaRequestMux0Group1PWM1CP3 = 13|0x200U, /*!< PWM1 Capture 3. */
    kDmaRequestMux0Group1CAN2 = 14|0x200U, /*!< CAN2. */
    kDmaRequestMux0Group1Reserved15 = 15|0x200U, /*!< Reserved15 */
    kDmaRequestMux0Group1SPI1Rx = 16|0x200U, /*!< SPI1 Receive. */
    kDmaRequestMux0Group1SPI1Tx = 17|0x200U, /*!< SPI1 Transmit. */
    kDmaRequestMux0Group1Reserved18 = 18|0x200U, /*!< Reserved18 */
    kDmaRequestMux0Group1Reserved19 = 19|0x200U, /*!< Reserved19 */
    kDmaRequestMux0Group1Reserved20 = 20|0x200U, /*!< Reserved20 */
    kDmaRequestMux0Group1Reserved21 = 21|0x200U, /*!< Reserved21 */
    kDmaRequestMux0Group1I2C1 = 22|0x200U, /*!< I2C1. */
    kDmaRequestMux0Group1Reserved23 = 23|0x200U, /*!< Reserved23 */
    kDmaRequestMux0Group1Reserved24 = 24|0x200U, /*!< Reserved24 */
    kDmaRequestMux0Group1Reserved25 = 25|0x200U, /*!< Reserved25 */
    kDmaRequestMux0Group1Reserved26 = 26|0x200U, /*!< Reserved26 */
    kDmaRequestMux0Group1Reserved27 = 27|0x200U, /*!< Reserved27 */
    kDmaRequestMux0Group1Reserved28 = 28|0x200U, /*!< Reserved28 */
    kDmaRequestMux0Group1Reserved29 = 29|0x200U, /*!< Reserved29 */
    kDmaRequestMux0Group1Reserved30 = 30|0x200U, /*!< Reserved30 */
    kDmaRequestMux0Group1Reserved31 = 31|0x200U, /*!< Reserved31 */
    kDmaRequestMux0Group1FTM2Channel0 = 32|0x200U, /*!< FTM2 C0V. */
    kDmaRequestMux0Group1FTM2Channel1 = 33|0x200U, /*!< FTM2 C1V. */
    kDmaRequestMux0Group1SPI2Rx = 34|0x200U, /*!< SPI2 Receive. */
    kDmaRequestMux0Group1SPI2Tx = 35|0x200U, /*!< SPI2 Transmit. */
    kDmaRequestMux0Group1IEEE1588Timer0 = 36|0x200U, /*!< ENET IEEE 1588 timer 0. */
    kDmaRequestMux0Group1IEEE1588Timer1 = 37|0x200U, /*!< ENET IEEE 1588 timer 1. */
    kDmaRequestMux0Group1IEEE1588Timer2 = 38|0x200U, /*!< ENET IEEE 1588 timer 2. */
    kDmaRequestMux0Group1IEEE1588Timer3 = 39|0x200U, /*!< ENET IEEE 1588 timer 3. */
    kDmaRequestMux0Group1HSADC1A = 40|0x200U, /*!< HSADC1. */
    kDmaRequestMux0Group1HSADC1B = 41|0x200U, /*!< HSADC1. */
    kDmaRequestMux0Group1Reserved42 = 42|0x200U, /*!< Reserved42 */
    kDmaRequestMux0Group1Reserved43 = 43|0x200U, /*!< Reserved43 */
    kDmaRequestMux0Group1Reserved44 = 44|0x200U, /*!< Reserved44 */
    kDmaRequestMux0Group1ADC0 = 45|0x200U, /*!< ADC0. */
    kDmaRequestMux0Group1Reserved46 = 46|0x200U, /*!< Reserved46 */
    kDmaRequestMux0Group1Reserved47 = 47|0x200U, /*!< Reserved47 */
    kDmaRequestMux0Group1Reserved48 = 48|0x200U, /*!< Reserved48 */
    kDmaRequestMux0Group1Reserved49 = 49|0x200U, /*!< Reserved49 */
    kDmaRequestMux0Group1Reserved50 = 50|0x200U, /*!< Reserved50 */
    kDmaRequestMux0Group1Reserved51 = 51|0x200U, /*!< Reserved51 */
    kDmaRequestMux0Group1Reserved52 = 52|0x200U, /*!< Reserved52 */
    kDmaRequestMux0Group1Reserved53 = 53|0x200U, /*!< Reserved53 */
    kDmaRequestMux0Group1UART4Rx = 54|0x200U, /*!< UART4 Receive. */
    kDmaRequestMux0Group1UART4Tx = 55|0x200U, /*!< UART4 Transmit. */
    kDmaRequestMux0Group1UART5Rx = 56|0x200U, /*!< UART5 Receive. */
    kDmaRequestMux0Group1UART5Tx = 57|0x200U, /*!< UART5 Transmit. */
    kDmaRequestMux0Group1Reserved58 = 58|0x200U, /*!< Reserved58 */
    kDmaRequestMux0Group1Reserved59 = 59|0x200U, /*!< Reserved59 */
    kDmaRequestMux0Group1AlwaysOn60 = 60|0x200U, /*!< DMAMUX Always Enabled slot. */
    kDmaRequestMux0Group1AlwaysOn61 = 61|0x200U, /*!< DMAMUX Always Enabled slot. */
    kDmaRequestMux0Group1AlwaysOn62 = 62|0x200U, /*!< DMAMUX Always Enabled slot. */
    kDmaRequestMux0Group1AlwaysOn63 = 63|0x200U, /*!< DMAMUX Always Enabled slot. */
#elif defined(MCU_MKL28T7)
    kDmaRequestMux0Disable = 0|0x300U, /*!< DMA requests are disabled. */
    kDmaRequestMux0FLEXIOShifter0 = 1|0x300U, /*!< FLEXIO0 shifter0 */
    kDmaRequestMux0FLEXIOShifter1 = 2|0x300U, /*!< FLEXIO0 shifter1 */
    kDmaRequestMux0FLEXIOShifter2 = 3|0x300U, /*!< FLEXIO0 shifter2 */
    kDmaRequestMux0FLEXIOShifter3 = 4|0x300U, /*!< FLEXIO0 shifter3 */
    kDmaRequestMux0FLEXIOShifter4 = 5|0x300U, /*!< FLEXIO0 shifter4 */
    kDmaRequestMux0FLEXIOShifter5 = 6|0x300U, /*!< FLEXIO0 shifter5 */
    kDmaRequestMux0FLEXIOShifter6 = 7|0x300U, /*!< FLEXIO0 shifter6 */
    kDmaRequestMux0FLEXIOShifter7 = 8|0x300U, /*!< FLEXIO0 shifter7 */
    kDmaRequestMux0LPI2C0Rx = 9|0x300U, /*!< LPI2C0 receiver complete */
    kDmaRequestMux0LPI2C0Tx = 10|0x300U, /*!< LPI2C0 transmit complete */
    kDmaRequestMux0LPI2C1Rx = 11|0x300U, /*!< LPI2C1 receiver complete */
    kDmaRequestMux0LPI2C1Tx = 12|0x300U, /*!< LPI2C1 receiver complete */
    kDmaRequestMux0LPI2C2Rx = 13|0x300U, /*!< LPI2C2 receiver complete */
    kDmaRequestMux0LPI2C2Tx = 14|0x300U, /*!< LPI2C2 receiver complete */
    kDmaRequestMux0LPUART0Rx = 15|0x300U, /*!< LPUART0 receiver complete */
    kDmaRequestMux0LPUART0Tx = 16|0x300U, /*!< LPUART0 transmit complete */
    kDmaRequestMux0LPUART1Rx = 17|0x300U, /*!< LPUART1 receiver complete */
    kDmaRequestMux0LPUART1Tx = 18|0x300U, /*!< LPUART1 transmit complete */
    kDmaRequestMux0LPUART2Rx = 19|0x300U, /*!< LPUART2 receiver complete */
    kDmaRequestMux0LPUART2Tx = 20|0x300U, /*!< LPUART2 transmit complete */
    kDmaRequestMux0LPSPI0Rx = 21|0x300U, /*!< LPSPI0 receiver complete */
    kDmaRequestMux0LPSPI0Tx = 22|0x300U, /*!< LPSPI0 transmit complete */
    kDmaRequestMux0LPSPI1Rx = 23|0x300U, /*!< LPSPI1 receiver complete */
    kDmaRequestMux0LPSPI1Tx = 24|0x300U, /*!< LPSPI1 transmit complete */
    kDmaRequestMux0LPSPI2Rx = 25|0x300U, /*!< LPSPI2 receiver complete */
    kDmaRequestMux0LPSPI2Tx = 26|0x300U, /*!< LPSPI2 transmit complete */
    kDmaRequestMux0TPM0Channel0 = 27|0x300U, /*!< TPM0 channel 0 event */
    kDmaRequestMux0TPM0Channel1 = 28|0x300U, /*!< TPM0 channel 1 event */
    kDmaRequestMux0TPM0Channel2 = 29|0x300U, /*!< TPM0 channel 2 event */
    kDmaRequestMux0TPM0Channel3 = 30|0x300U, /*!< TPM0 channel 3 event */
    kDmaRequestMux0TPM0Channel4 = 31|0x300U, /*!< TPM0 channel 4 event */
    kDmaRequestMux0TPM0Channel5 = 32|0x300U, /*!< TPM0 channel 5 event */
    kDmaRequestMux0Reserved33 = 33|0x300U, /*!< Reserved33 */
    kDmaRequestMux0Reserved34 = 34|0x300U, /*!< Reserved34 */
    kDmaRequestMux0TPM0Overflow = 35|0x300U, /*!< TPM0 overflow event */
    kDmaRequestMux0TPM1Channel0 = 36|0x300U, /*!< TPM1 channel 0 event */
    kDmaRequestMux0TPM1Channel1 = 37|0x300U, /*!< TPM1 channel 1 event */
    kDmaRequestMux0TPM1Overflow = 38|0x300U, /*!< TPM1 overflow event */
