m-okada/QV08/emu/ARM/kinetis_workspace/t03/SDK/platform/drivers/inc/fsl_edma_request.h
    kDmaRequestMux0TPM2Channel0 = 39|0x300U, /*!< TPM2 channel 0 event */
    kDmaRequestMux0TPM2Channel1 = 40|0x300U, /*!< TPM2 channel 1 event */
    kDmaRequestMux0TPM2Overflow = 41|0x300U, /*!< TPM2 overflow event */
    kDmaRequestMux0PORTRPM = 42|0x300U, /*!< PORTRPM */
    kDmaRequestMux0EMVSIMRx = 43|0x300U, /*!< EMWSIM receive complete */
    kDmaRequestMux0EMVSIMTx = 44|0x300U, /*!< EMWSIM transmit complete */
    kDmaRequestMux0I2S0Rx = 45|0x300U, /*!< I2S0 receive */
    kDmaRequestMux0I2S0Tx = 46|0x300U, /*!< I2S0 transmit */
    kDmaRequestMux0PORTA = 47|0x300U, /*!< PORTA rising, falling or both edges */
    kDmaRequestMux0PORTB = 48|0x300U, /*!< PORTB rising, falling or both edges */
    kDmaRequestMux0PortC = 49|0x300U, /*!< PORTC rising, falling or both edges */
    kDmaRequestMux0PortD = 50|0x300U, /*!< PORTD rising, falling or both edges */
    kDmaRequestMux0PortE = 51|0x300U, /*!< PORTE rising, falling or both edges */
    kDmaRequestMux0ADC0 = 52|0x300U, /*!< ADC0 */
    kDmaRequestMux0Reserved53 = 53|0x300U, /*!< Reserved53 */
    kDmaRequestMux0DAC0 = 54|0x300U, /*!< DAC0 */
    kDmaRequestMux0Reserved55 = 55|0x300U, /*!< Reserved55 */
    kDmaRequestMux0CMP0 = 56|0x300U, /*!< CMP0 */
    kDmaRequestMux0CMP1 = 57|0x300U, /*!< CMP1 */
    kDmaRequestMux0Reserved58 = 58|0x300U, /*!< Reserved58 */
    kDmaRequestMux0Reserved59 = 59|0x300U, /*!< Reserved59 */
    kDmaRequestMux0AlwaysOn60 = 60|0x300U, /*!< Slot 60 is always enabled */
    kDmaRequestMux0AlwaysOn61 = 61|0x300U, /*!< Slot 61 is always enabled */
    kDmaRequestMux0AlwaysOn62 = 62|0x300U, /*!< Slot 62 is always enabled */
    kDmaRequestMux0AlwaysOn63 = 63|0x300U, /*!< Slot 63 is always enabled */
#elif defined(CPU_MKW21D256VHA5) || defined(CPU_MKW21D512VHA5) || defined(CPU_MKW22D512VHA5) || defined(CPU_MKW24D512VHA5)
    kDmaRequestMux0Disable = 0|0x100U, /*!< DMAMUX TriggerDisabled. */
    kDmaRequestMux0Reserved1 = 1|0x100U, /*!< Reserved1 */
    kDmaRequestMux0UART0Rx = 2|0x100U, /*!< UART0 Receive. */
    kDmaRequestMux0UART0Tx = 3|0x100U, /*!< UART0 Transmit. */
    kDmaRequestMux0UART1Rx = 4|0x100U, /*!< UART1 Receive. */
    kDmaRequestMux0UART1Tx = 5|0x100U, /*!< UART1 Transmit. */
    kDmaRequestMux0UART2Rx = 6|0x100U, /*!< UART2 Receive. */
    kDmaRequestMux0UART2Tx = 7|0x100U, /*!< UART2 Transmit. */
    kDmaRequestMux0Reserved8 = 8|0x100U, /*!< Reserved8 */
    kDmaRequestMux0Reserved9 = 9|0x100U, /*!< Reserved9 */
    kDmaRequestMux0Reserved10 = 10|0x100U, /*!< Reserved10 */
    kDmaRequestMux0Reserved11 = 11|0x100U, /*!< Reserved11 */
    kDmaRequestMux0Reserved12 = 12|0x100U, /*!< Reserved12 */
    kDmaRequestMux0Reserved13 = 13|0x100U, /*!< Reserved13 */
    kDmaRequestMux0I2S0Rx = 14|0x100U, /*!< I2S0 Receive. */
    kDmaRequestMux0I2S0Tx = 15|0x100U, /*!< I2S0 Transmit. */
    kDmaRequestMux0SPI0Rx = 16|0x100U, /*!< SPI0 Receive. */
    kDmaRequestMux0SPI0Tx = 17|0x100U, /*!< SPI0 Transmit. */
    kDmaRequestMux0SPI1Rx = 18|0x100U, /*!< SPI1 Receive. */
    kDmaRequestMux0SPI1Tx = 19|0x100U, /*!< SPI1 Transmit. */
    kDmaRequestMux0Reserved20 = 20|0x100U, /*!< Reserved20 */
    kDmaRequestMux0Reserved21 = 21|0x100U, /*!< Reserved21 */
    kDmaRequestMux0I2C0 = 22|0x100U, /*!< I2C0. */
    kDmaRequestMux0I2C1 = 23|0x100U, /*!< I2C1. */
    kDmaRequestMux0FTM0Channel0 = 24|0x100U, /*!< FTM0 C0V. */
    kDmaRequestMux0FTM0Channel1 = 25|0x100U, /*!< FTM0 C1V. */
    kDmaRequestMux0FTM0Channel2 = 26|0x100U, /*!< FTM0 C2V. */
    kDmaRequestMux0FTM0Channel3 = 27|0x100U, /*!< FTM0 C3V. */
    kDmaRequestMux0FTM0Channel4 = 28|0x100U, /*!< FTM0 C4V. */
    kDmaRequestMux0FTM0Channel5 = 29|0x100U, /*!< FTM0 C5V. */
    kDmaRequestMux0FTM0Channel6 = 30|0x100U, /*!< FTM0 C6V. */
    kDmaRequestMux0FTM0Channel7 = 31|0x100U, /*!< FTM0 C7V. */
    kDmaRequestMux0FTM1Channel0 = 32|0x100U, /*!< FTM1 C0V. */
    kDmaRequestMux0FTM1Channel1 = 33|0x100U, /*!< FTM1 C1V. */
    kDmaRequestMux0FTM2Channel0 = 34|0x100U, /*!< FTM2 C0V. */
    kDmaRequestMux0FTM2Channel1 = 35|0x100U, /*!< FTM2 C1V. */
    kDmaRequestMux0Reserved36 = 36|0x100U, /*!< Reserved36 */
    kDmaRequestMux0Reserved37 = 37|0x100U, /*!< Reserved37 */
    kDmaRequestMux0Reserved38 = 38|0x100U, /*!< Reserved38 */
    kDmaRequestMux0Reserved39 = 39|0x100U, /*!< Reserved39 */
    kDmaRequestMux0ADC0 = 40|0x100U, /*!< ADC0. */
    kDmaRequestMux0Reserved41 = 41|0x100U, /*!< Reserved41 */
    kDmaRequestMux0CMP0 = 42|0x100U, /*!< CMP0. */
    kDmaRequestMux0CMP1 = 43|0x100U, /*!< CMP1. */
    kDmaRequestMux0Reserved44 = 44|0x100U, /*!< Reserved44 */
    kDmaRequestMux0Reserved45 = 45|0x100U, /*!< Reserved45 */
    kDmaRequestMux0Reserved46 = 46|0x100U, /*!< Reserved46 */
    kDmaRequestMux0CMT = 47|0x100U, /*!< CMT. */
    kDmaRequestMux0PDB = 48|0x100U, /*!< PDB0. */
    kDmaRequestMux0PortA = 49|0x100U, /*!< PTA. */
    kDmaRequestMux0PortB = 50|0x100U, /*!< PTB. */
    kDmaRequestMux0PortC = 51|0x100U, /*!< PTC. */
    kDmaRequestMux0PortD = 52|0x100U, /*!< PTD. */
    kDmaRequestMux0PortE = 53|0x100U, /*!< PTE. */
    kDmaRequestMux0AlwaysOn54 = 54|0x100U, /*!< DMAMUX Always Enabled_slot. */
    kDmaRequestMux0AlwaysOn55 = 55|0x100U, /*!< DMAMUX Always Enabled_slot. */
    kDmaRequestMux0AlwaysOn56 = 56|0x100U, /*!< DMAMUX Always Enabled_slot. */
    kDmaRequestMux0AlwaysOn57 = 57|0x100U, /*!< DMAMUX Always Enabled_slot. */
    kDmaRequestMux0AlwaysOn58 = 58|0x100U, /*!< DMAMUX Always Enabled_slot. */
    kDmaRequestMux0AlwaysOn59 = 59|0x100U, /*!< DMAMUX Always Enabled_slot. */
    kDmaRequestMux0AlwaysOn60 = 60|0x100U, /*!< DMAMUX Always Enabled_slot. */
    kDmaRequestMux0AlwaysOn61 = 61|0x100U, /*!< DMAMUX Always Enabled_slot. */
    kDmaRequestMux0AlwaysOn62 = 62|0x100U, /*!< DMAMUX Always Enabled_slot. */
    kDmaRequestMux0AlwaysOn63 = 63|0x100U, /*!< DMAMUX Always Enabled_slot. */
#else
    #error "No valid CPU defined!"
#endif
} dma_request_source_t;

/* @} */

#endif /* __FSL_EDMA_REQUEST_H__ */

/*******************************************************************************
 * EOF
 ******************************************************************************/

